{
        "blogContent": [
                {
                        "date": "6/7/2020 15:37:49",
                        "username": "tacowhisperer",
                        "title": "I didn't touch the coffee machine this morning, wow",
                        "link": "https://imgur.com/gallery/Homaq/comment/791986463/1",
                        "content": "WHAT a freaking day, man. Usually, 🔥 days like these only happen with Militant Man, but this system is chaotic and entirely dependent on Boss Man's mood for the morning. Today, the mood was \"Why are there more cashiers than carniceros right now.\" Same, Boss Man, same.\n\nSo, I spend the majority of the morning and some of the midday hopping up and down the store getting pedidos ready to go (according to Pokémon Go, I walked 5 miles today, go figure), but today I got Mr. Luisito's order. It didn't seem so bad, just the usual weird shit he always buys like this VERY SPECIFIC BRAND OF SMOOTH PLATES OHMYGOD IF IT'S NOT THIS BRAND I WANT NOTHING, and caldo veggies. Except, that in my mind's eye, I didn't think that when the pedido said \"3 cabbage\", they meant 3 boxes of cabbage, so I just got this baldy 3 heads of cabbage and called it done. I fucking wish I was up front for this, it sounds like it would have been hilarious to watch from afar, but apparently, he made such a big god damned shitshow that his order WASN'T COMPLETE WHO THE FUCK DID THIS ORDER AHHHHH that even the taqueria ladies in the kitchen in the back were telling me about it LMAO. Jesus fuck now that's the Luisito I know. Fuck this man, but at the same time it's funny how stirred up he gets over minor details and very easily fixable problems........... just like Boss Man.\n\nI also worked on a pedido for La Morenita; ezpz stuff and very straightforward to complete. Today, after the transaction was all said and done, it was time to load it up to their delivery man's truck, and it was just me and Chief.com to get that done. I would say that we both did about equal parts work getting it loaded in, but when their delivery guy came up to tip, he passed the money in front of Chief.com's face and said told me \"Here you go, thanks.\" UHHHHH lol I didn't want to be a dick and keep it all, so I gave Chief.com 30%, but shit man people really do be clear cut on how they perceive work gets done. Apparently, I have a very \"hard working demeanor\", but really I just think it's the light skin ¯\\_(ツ)_/¯.\n\nFinally, Cash King came in today with half his face swollen from being in a fist fight. Don't fuck with Cash King."
                },
                {
                        "date": "6/6/2020 15:40:46",
                        "username": "tacowhisperer",
                        "title": "Title for cutest couple has officially been claimed, prove me wrong.",
                        "link": "https://tenor.com/tpVK.gif",
                        "content": "The store opened up for the third time this week at 5:30am. As I imagined, the alarm clock this morning was just pure pain, like waking up for an 8am for college, but literally way fucking worse because it's out of necessity. And yet, somehow, there are people that see the doors open before 6am and just decide to start their day grocery shopping 🤮 Literally not even 10 minutes into opening, a crackhead couple walked into the store. Usually, when crackheads walk in bright and early in the morning, it means that they've been out and about and are looking for a quick fix of cigarettes or beer or something before moving on. This time though, these people got themselves a cart and started shopping around. In my time working here, I've only seen a handful of people that go 30+ minutes walking about shopping comparing prices and generally just taking their sweet time getting their errand done. No one batted an eye at this couple until 30, 40, 50 minutes went by and they were still walking around the store looking through item after item. After all the red flags had been raised, Militant Man went full, well, militant mode, just letting everyone know to keep an eye out for any funny business conducted by these people. I watched from afar how they went shelf by shelf, item by item, but neither of them had large bags or deep pockets to keep anything in, so I was just completely baffled, but mostly entertained by the prospect that someone would come in and first thing in the morning sack the store, especially before 6am.\n\nAfter the first morning rush of people trying to get their daily fix of coffee, I decided to go sleuthing and see what the deal with them was. I swear, these two were literally just casually shopping and reading the descriptions of every single item that they came across like it was their first time going shopping for themselves. They had a really nice demeanor, and I felt bad for judging them so harshly for their very obvious substance abuse. The real life Carl and Ellie, if you will. For example, the man would say \"Hey babe, come look at this soap. It says to use in HIGH EFFICIENCY machines!\" It really was that innocent of a trip, and I felt like an asshole for the rest of the time they were there. They ended up leaving around 7:30am, so they were easily in there for at least an hour and a half -- that's gotta be a record somewhere for genuine shopping time (they definitely won't beat this one old lady that comes in and takes like 3 hours to buy like 2 bags of cookies and a couple of vegetables and milk... that old lady is QUEEN at taking her sweet ass time, like not even The Men are willingly present that long in their own store lmao).\n\nMy one year anniversary is coming up in 21 days, so woooo...."
                },
                {
                        "date": "6/5/2020 22:25:07",
                        "username": "tacowhisperer",
                        "title": "Some days you start out feeling like $1000, then Boss Man comes in and gives you a reality check.",
                        "link": "https://giphy.com/gifs/htiVRuP7N0XK/html5",
                        "content": "Today's fuck up of the day that didn't happen today: I accepted a $50 bill that didn't have both serial numbers. Ugh. Granted, I didn't know about the serial number thing; I had just assumed that that one random bit about legal bills I read about 10 years ago about how a bill over 50% available is legal tender, but Boss Man really made sure to just 🔨🔨🔨🔨🔨🔨🔨 bust my balls today about it. Really puts a strain on how much longer I'll be able to put up with such open and raw reprimanding, but as soon as I take a look at the bank account, I just get sent riiiight back to my current state of affairs of having to work at this blessed grocery store. It really helps that even Boss Man's niece doesn't escape his event horizon; we're 35 years too late in changing his ways. F\n\nPaletero man showed up today and I finally actually ate the pop he gave me. It was good, and I only felt bloated for 2 hours after eating it, so it was definitely a win :P\n\nCute story update! So, children are starting to be let into the store by their parents as 'rona becomes older and older news every passing week. Of course, as soon as that thing arrives at the store, everyone is most definitely mega screwed. You see masks down on people everywhere, especially the boss man, but depressing news aside, I find it cute how people start to make kid's sized masks! Like, look at their dumb little faces, so innocent and unjaded... This mom was walking in with 3 of her little girls, and the smallest one didn't have her mask on. For some reason, mamma didn't remember about her face covering until they were inside the store, so she takes out what I would assume is a face mask for herself that she had in her purse and put it on her before they got too far inside. But her face is very obviously too small, and as soon as mom put the thing on her face, it was like she took saran wrap and wrapped her entire face from forehead to chin 😂😂😭 Normally, I'd say fuck 'em kids, but the way the little girl stumbled then when mom finally realized what she had done and I just couldn't contain myself. I laughed and the mom laughed too. Mom quickly fixed the mask for her, but my tender heart, omgggg.\n\nT minus 4 hours until I have to get up and start getting ready for work lmao I'm fucking dead on the inside and outside. Ok, bye."
                },
                {
                        "date": "6/4/2020 14:26:55",
                        "username": "tacowhisperer",
                        "title": "I am become manganer, he who commands Militant Man through pathos, logos, and ethos.",
                        "link": "https://tenor.com/FUIg.gif",
                        "content": "Today I gave Militant Man a task -- to take a couple of unwanted chickens back to the carnicería, and he said \"yes sir\". I'm gonna ride that high until next week.\n\nSo, both Grape Man and Diet Coke Lady stopped by today, but neither of them did anything interesting other than buy, well, Grape cigars and Diet Coke. Grape Man DID comment on a coworker's outfit, so that's something I guess, but nothing else from them.\n\nThis old man came in today and was getting whatever. The thing that caught my attention from him, though, was that this man was casually wearing some toenail clippers on his necklace like he needs to be ready at a moment's notice of a sudden pedicure. For some reason, I found this amusing, but I didn't really ask him any questions. He reminded me of another old man that used to swing by fairly regularly - Quarter Ear Man. He would walk around the store and do everything normally, except that he would have a quarter sticking out from either ear.....\n\nRight toward the end of the shift, I had to charge a cartfull of random stuff for these 3 super round ladies. I'm no health guru, but I've spent well over a year working on changing my body so I've learned a thing or two about food nutrition, and by working here for the past 11 months at the time of this writing, I've definitely noticed that the quantity and proportion of sugary and fatty foods that people buy are directly proportional to their apparent body mass index. In layman's terms, fat people buy hella junk food, and these 3 ladies were no exception to this observation -- Bimbo, sandwich supplies, sweet bread, candy, cooking oil, every cheese imaginable, etc..\n\nOnce I was done charging their loot, the main one hollers at the other two \"Hey, y'all forgot to get the drinks. What are y'all gonna drink that meat with, air?\" Sure enough, I look down and they actually forgot to get anything to drink! As soon as I thought at them, \"maybe a little bit of water would help y'all some,\" another one yelled back \"Air? Bitch it's called water.\" Fucking LOOOOOL I held back my urge to laugh, and I watched in amusement as they scrambled among themselves to figure out what to get to drink until finally the one that thought they were drinking air waddled over to the cold Cokes and heaved a couple of 12 packs \"for good measure\". They paid with Lone Star, a classic move with cartfulls of junkfood (God bless poverty and the sugar that keeps it afloat), and finally went on their merry way.\n\nThis morning Militant Man has officially confirmed that the store will be opening at 5:30am. It makes sense because it's very rushed to try and get coffee done before swarms of people start walking in but fuuUuuUUuuUUuuuUUUUUuuUuuuck"
                },
                {
                        "date": "6/3/2020 15:38:00",
                        "username": "tacowhisperer",
                        "title": "Me tryinna sneak some work in without getting called to the register",
                        "link": "https://media.giphy.com/media/3ohhwytHcusSCXXOUg/giphy.gif",
                        "content": "Why in the actual f did I go to this blessed store on my day off? Money. That's why. The end."
                },
                {
                        "date": "6/2/2020 21:50:15",
                        "username": "tacowhisperer",
                        "title": "I remembered why I laughed yesterday LMAOO",
                        "link": "https://gfycat.com/understatedwateryemperorshrimp",
                        "content": "Ok, so yesterday I was charging Cash King, this one dude that buys meat for his taqueria. He's a respectable man; he always comes with his best boots and belt, and always pulls out nice THICK wads of unordered cash to pay for his tripas, chuck roll, pastor, you name it, hence the nickname. Something about his personality or his physical features (definitely both) rub off on you as him being a hard working, but also very personable man. So this very well shaped lady walks by while he's paying me, and he knows that I know that he knows that we know that that was some fiiiiiiiine booty walking by. This man pauses his cash counting, closes his eyes, and does a little sign of the cross, and then keeps on counting cash like the fucking king that he is LOOOOOOOOL God damn, that's a level of ass admiration that I've never seen anywhere else before 👏👏👏 I just can't believe I forgot entirely about this when I wrote my blog entry yesterday. Better late than never!\n\nToday's main superstar was gone - Kintsu you piece of shit, I love you bro, and it hurts when you're gone ;c Of all days to miss work, you chose payday you dum dum it better have been a good fucking reason. It wouldn't have been such a big deal though, if it weren't that Big Boss's daughter was also absent lmao. When we needed y'all most, you vanished! The show went on though, so mad props to QtSteel for pulling that bread through and me for knowing how to make up prices for big list items like the big genius that I am.\n\nBut enough about me and my big, sexy brain (that totally doesn't make mistakes ever). Instead, let's talk about this fucking lil fatty bitch of a 10-12 year old girl that started crying because her mommy didn't buy her Cheetos Funyuns. Holy moly. I'm not a parent yet, so take my words with a pound of salt, but there's undeniably an age cutoff for when kids should stop making spectacles out in public. Lord, if that were my kid I would beat that shit out of her so fast she never knew what hit her. I'm kidding of course, but I definitely wouldn't let that kind of behavior grow out of hand. Some of the parents that come in and buy stuff for their kids really do be out there being money slaves to their every whims like try keeping that up in their teens and young adult lives see how that works out for you. My guess is those kids would end up working at a grocery store run by some middle eastern middle aged men that have an authoritarian grasp over every aspect of how the store operates, to the point where they would remind you about an item you undercharged for two days because It'S iMpOrTaNt FoR mAiNtAiNiNg ThE pRoFiT mArGin. Bruh, a single (key word here SINGLE, as in 1 time) 60¢ loss on an item ain't gonna ruin the store, buddy. Still kinda salty about that one 😤😤😤\n\nANYWAY, Big Boss almost hit this dude with his truck. What a Big Boss thing for him to do 🤦‍♂️. Poor guy was mad at him, and for good reason, but good luck fighting the man that controls the entire suburb. He got the police department eating out of the palm of his hand BOY. This guy went to school with QtSteel, so she knows his name and personal details, but what she doesn't know that I know about him is where he lives (saw him walking out of his house on a trip to find stolen carts for Boss Man), and that he asked for Eevee's whereabouts one time around Thanksgiving/Christmas.\n\n🌈the more you know🌈🌟"
                },
                {
                        "date": "6/1/2020 22:22:41",
                        "username": "tacowhisperer",
                        "title": "I can't remember why I laughed big time yesterday, but here's a funny story",
                        "link": "https://gfycat.com/demandingathleticisabellineshrike",
                        "content": "I like to complain a lot with my coworkers about the shitty clients, and don't get me wrong, they suck the life right out of your gonads. That being said, no shitty clients also means no super interesting stories to tell, sadly. Funniest part of the day was when my coworker was walking out and making her final purchase. The paletero brought her a mangonada specially for her, and she had left it in the cooler all day to take. She was fixing to walk away, and she tells me \"Hopefully the paletero didn't put any love potion in it cuz it ain't gonna work on me\". For some reason, I found that hilarious and random as fuck, so I played along and asked her \"Why, he's a good working man and full of nothing but sweetness\" and she responded \"Well, it's for my son, so if anyone's gonna be falling for him it's gonna be him\". Anyway, that was hilarious. To think that she was at one point my least favorite coworker too. You live and you learn I guess!\n\nUmmmmmmmmmmmmmmm, no crackheads today, baskets still suck, these riots and lootings be getting crazy, 2020 really be out here one upping itself every day, stonks only go up, okay I'm done."
                },
                {
                        "date": "5/31/2020 14:32:15",
                        "username": "tacowhisperer",
                        "title": "May, May goes away. Comes again another day.",
                        "link": "https://gfycat.com/elatedwarmherculesbeetle",
                        "content": "The word that best describes today: standard. No Grape Man today, so kind of a bummer on that one. We did get a special visit from Diet Coke Lady though! Man, that woman has lost some WEIGHT, probably cuz all she does is smoke all day and drink Diet Coke in between. Still has that crazy stink eye like always, and her manner of walking and talking still make it feel like she's gonna fall over and break her skull, but she certainly stopped coming over like she used to on the daily for her \"ChEaP 3 dOlLaR cIgArEtTeS\".\n\nFeelsbadman for the manager today: he tries so hard to be healthy and follow what I can only imagine is his doctor/wife's diet plan, but his little maneuver today is just priceless. He came to my register to pay for a 7-UP and some Funyuns, a classic move when he's got the munchies on the triple. I don't judge. In fact, I feel bad for him because I know just how badly he wants to stop being overweight. But anyways, I had noticed a little disposible tray in the register behind me, and usually that area is reserved for the managers when they're snacking. I didn't think much of it, until I had nothing going on for a brief couple of minutes. I opened up the container and found a fork and a few cactus bits in there. This man gave up eating the cactuses and got himself those Funyuns lmaooo Fucking same. Well, that, or he tried to cancel out his sinful food with some healthy stuff. Either way, it sucks that healthy food just doesn't taste that great, but what can I say other than the struggle is real."
                },
                {
                        "date": "5/30/2020 18:58:45",
                        "username": "tacowhisperer",
                        "title": "The day was pure 🔥🔥🔥, up to the very end.",
                        "link": "https://gfycat.com/angrygoldenisabellinewheatear-this-is-fine-gifcask",
                        "content": "Today was a suuuper busy morning, and I mean for whatever reason, everybody wanted to buy the biiiig big bulks of meat. Good for the store, bad for the back (I definitely strained my disks today, yikes....). This morning came in this pretty little princess of a man and his hog of a wife. Nothing out of the ordinary, except for the fact that my man wasn't \"attended like he should be\" and without him and his tiny purchase we don't get to get paid -_-. All of this at 6:30 in the fucking am just because my coworker didn't go out of her way to find another pack of coffee cups just for him since the ones he was forcing out of the cup holder kept ripping (this ding dong didn't realize that you can also get the cups from behind where they don't get damaged). Personally, I would have gotten him and his mistress their cups for coffee since it's whatever, but the man literally stayed quiet when I asked him how I could help and instead chose to keep on ranting and ranting and ranting. Jesus fuck, these people are literally bots -- prove me wrong. I accidentally made my coworker laugh for dismissing him as a lost case before he was out of earshot, and he turned around and yelled \"Go ahead and laugh at me, you clowns\". looool Outside the daily 1 or 2 frisky clients that want to make a giant fucking scandal out of the tiniest issues, everything seemed to be going about as smoothly as it could.\n\nThen came in this omega asshole. This motherfucker, Luisito, is an old, bald, arrogant, demanding, narcissistic sleaze, and every time he's in the store, everybody's cortisol level rises. Normally, I don't mind him doing his thing, but today Mr. Luisito decided it would be a good idea to not only interrupt me while I was trying to handle 3 different tasks at the same, but to do so while coming from behind me and snatching the pen I was using right out of my hand. THIS BITCH OOHHHHMAHHGAWD I fucking lost it. Normally, I'm a gentle giant, but today I went corporate on his ass. I snatched that pen right out of his hand and I told him straight up that if he wants something he has to wait his god damned turn. I don't know if I overdid it (according to my coworker, she'd never seen me be that visibly angry before), or if apart from all those adjectives I used to describe him he's also a lil bitch (probably definitely, yes), but boyyyyy this man changed his tune so quick. He started yes manning me for the remainder of the time he was in the store, and behaved pretty nicely after that. Man, my blood still boils thinking about this man, ugh SUBJECT CHANGE!\n\nOk, so funny moment flashback. This didn't happen today, it actually happened a few weeks ago, but it's worth mentioning here. Imagine it's March 20, 2020; the coronavirus pandemic is just barely a week old, and grocery stores have been sacked down to the offbrands of the offbrands. This hardy fucking store pulled through (BIG big props to our managers for working through that, I genuinely hope they've recovered from those tumultuous couple of weeks), but recovery wasn't obvious at the time. Now, imagine for a second that you're a dummy idiot and believe that the world's toilet paper supply would never recover from the scare, so you bought the giant $45 rolls that Mexico Lindo had (and still has) available. I would imagine you'd be livid to find out that the good brands of toilet paper slowly came back into circulation 3 weeks later, and now you're stuck with at least a year's worth of shitty toilet paper lmaoo.\n\nWell, this one Karen thought it would be a great idea to come back with one of those rolls and demand a refund for one of those giant packs. BRUHHHHHHHHHHHHHHHHHH There was a limit at the time of 1 of the little packs inside the giant pack at the time, and the managers HAD to have made a personal exception for her to buy the giant roll. That was the easiest professional \"fuck off\"'s I've ever seen been dealt to someone, and despite her persistence, our manager didn't yield and she left with her giant pack in shame. I swear, I expect the worst from people, and I'm somehow still surprised at how low and shameless some people are willing to go to have their way. The vibe in the air after she left defeated was cathartic; call it a post-nut clarity if you will.\n\nFinally, the basket holder's back in the tripping spot again yaaaay... We still got 2 baskets in this ho so fuck 'em up fam."
                },
                {
                        "date": "5/29/2020 22:39:17",
                        "username": "tacowhisperer",
                        "title": "I've made software more complex than Boss Man's personality lol",
                        "link": "https://giphy.com/gifs/fB938PbR1ulsA/html5",
                        "content": "Imagine walking up to Boss Man to start the day and you see THAT^^. I kind of already suspected what was going on, but it didn't take much (actually, I just kinda stood there) and he immediately just straight up told me he's sick and tired of babysitting Chief.com. Feelsbadman for him and Chief.com, but at the same time, this kid really do be out here hiding for hours at a time like............ just stay home if you're gonna fuck around. You wanna fuck around and be paid, you gotta get white collar job boy, JUST sayin'. To Chief.com's credit, he DID make a valuable contribution today: he made me figure out how many minutes there are in October lmaoo. Like, it's an easy calculation, but not the kind of thing you'd expect from Chief.com and friends. Good shit Chief.com, you go Chief.com!\n\nGrape Man joined the party today! He got his dinner of two 6 packs of cheap beer, but he surprisingly didn't ask for 99¢ cigs. Instead, he walked up to my register and said he was sorry for what he said last time -- that he didn't mean the things he said about Big Boss's daughter. Honestly, I didn't know what the hell he was talking about for about 3 sentences, until he mentioned that he was just \"blowing smoke up her ass\". LMAOOO Well, that's a sentence I never expected to hear from Grape Man, not because it's original or out of context. He's just usually not that cool about social situations; usually he's balls deep about some deep state conspiracy theory he saw on the YouTubes. Grape Man, if you have somehow through your own wit stumbled on this post, you're a beautiful human being in your own way, take a shower more often (I don't have the cojones to tell you in person), and what you got going on is, quite literally, something worth studying in depth. They say keep Austin weird, and you singlehandedly keep Texas weird my guy ;)\n\nToday a group of 3 musketeers showed up to buy a 24 pack of beer -- the over 21 guy, the money guy, and the wingman. Nothing seemed to be going out of the ordinary, until it was time to pay. I asked for ID, and after over 21 guy showed his 1996 birthday or wuteva, money guy pulled out a gift debit card. He does the card payment procedure, hears the beep, and then stares visibly confused at the screen. He knows the transaction didn't go through, and I tell him the card only paid for $6. I shit you not, this motherfucker starts going all Zach Galifianakis math meme on me, and then he starts laughing. He tells his bros his bitch of a girlfriend owes him $24 cuz he knew that hoe had money in it before he got it today. BRUHHHHHHHH I've only ever seen that kind of shortage analysis from Boss Man, but this dum-knuck lookin ass out here figuring out why he's short and laughing about it with the bros had me all kinds of laughing like wow, what a bitch to take your money bro :P He ended up paying with cash, but when the little receipt came up with the big bold $6 he paid, he was like \"Yeah, lemme show her that\" and he fucking took the little paper too. I was fucking dead after that I swear.\n\nThe year is 20XX. Coronavirus has killed 99% of boomers, and Mexico Lindo still hasn't obtained handheld baskets. +1 to my bro Kintsu for moving the goD dammned basket holder to where it doesn't trip people <3.\n\nWhat a fucken day."
                },
                {
                        "date": "5/28/2020 15:28:30",
                        "username": "tacowhisperer",
                        "title": "Some days, you go in wearing your shirt backward, and that's ok.",
                        "link": "https://giphy.com/gifs/CQhvppGGlxgA0",
                        "content": "Aaaaand the basket holder is right back in its tripping area as scheduled, so fuck me for trying to prevent people from falling over c: We still got the same 2 lone baskets, so who knows how much longer until the last little one is taken.... low key I kinda want to see what will happen when they inevitably disappear.\n\nI wore my shirt backward for the first 5 hours of work today, so that was something hilarious to have pointed out to me (thank you, kind old lady). Morning shifts tend to have much fewer crackheads and crazy people, so today wasn't anything extremely out of the ordinary. Probably the worst bit was that I fucked up a classic Lone-Star/cash transaction. I left this poor lady without food stamps for the rest of her month because I forgot that our shitty POS software ignores cash payments that are registered first.\n\nOh, and I got to hear Boss Man call his favorite employee a dumbass. At least he didn't show up high as fuck to work lmaoo."
                },
                {
                        "date": "5/26/2020 22:30:21",
                        "username": "tacowhisperer",
                        "title": "Grape man strikes back!",
                        "link": "https://gfycat.com/evergreenremarkablefowl-tinfoil-jones-alex-hat",
                        "content": "I officially proved it - the grape man can be smelled before he is seen; my buckaroo Kintsu over here saw me first hand identify him by scent. Today he came in and bought his usual 1-2 of beer and 99¢ cigarettes, and kept his tinfoil hat commentary to a minimum, but the funniest bit today for him was his commentary on me and the Big Boss's daughter. She made the usual play where she pretends to be related to me, and he fell just like everybody else, but what he did different is that he started making an in-depth analysis about our different power levels of work. According to him, she is 15% more potent than me at the job. Good shit, Grape man, good shit...\n\nPersonally for me, the highlight of the day was making an Excel template for the smaller sheets of stickers that we have available for price tags. I got to chill by the computer and burn close to an hour working with that, so that was nice. I probably burned through 30 sheets of paper to get it just right, but it's for science so fuck 'em up fam. What I really wish is that I could dedicate my full time to working on item pricing, and creating a more streamlined way of handling the ever-changing prices on items all around the store. However, there's other priorities right now, like telling one of your bigger regular clients to fuck off (good job with that one, Big Boss). Granted, I did hear him telling his daughter that the client had lied and was definitely in the wrong, so assuming that's the case, it's refreshing to see that bickering doesn't always work for clients. It's defintely off-putting to get stuck in the middle of those discussions though, but what can I say other than it's what makes the ins and outs of the day that much more interesting.\n\nFinally, today officially marks another day without new handheld baskets. I tried to move the basket container once again to a spot where it won't trip people over. Hopefully with the new placement, the morning shift people will leave it be and it will inspire management to give these baskets a bit more priority..... pfffffft LOL.\n\nThat's all folks!"
                },
                {
                        "date": "5/25/2020 22:10:43",
                        "username": "tacowhisperer",
                        "title": "What even happened today?",
                        "link": "https://gfycat.com/sarcasticeducatedjohndory",
                        "content": "There seemed to be a couple of high surges in people today, especially around the 2-4pm hour block. Lots of fajita and marinaded selections, probably the extra bits left over from all them food stamps the government handed out this month (God bless America). Probably the funniest thing I heard all day was Boss Man calling out a woman on how she was a bitch to her man and that's why her ex-husband divorced her.\n\nNo grape man today :(\n\nAlso no new handheld baskets either ¯\\_(ツ)_/¯"
                },
                {
                        "date": "5/24/2020 23:20:42",
                        "username": "tacowhisperer",
                        "title": "Day 2 of the simulation",
                        "link": "https://media1.tenor.com/images/2d7f787c0eb9201b379365cbe175a8f7/tenor.gif",
                        "content": "Well, standard business today, just the usual ins and outs of the everyday swaths of people looking to buy barbacoa on a Sunday morning. Possibly the most exciting thing that happened today is I dropped a box of chile serrano on the floor lulz.\n\nAlso, grape man is shit out of luck because according to Boss Man, the supplier for his 99¢ cigarettes didn't have his sacred grape flavor. Also, fun fact, I finally found the grape man's channel! Odd TV 2 on YouTube:\n\nyoutube.com/channel/UCtpfIuNZKBQRQ8WERQVt6FQ/videos\n\nMy feed is basically fucked for the next month after searching for that one. Hell, I'm still not completely rid of the anime waifu ads that I contracted for watching the FF7 remake playthrough... but that's not a part of our Mexico Lindo story!\n\nFinally, I got verbal confirmation that we're getting new handheld baskets tomorrow, finally. That, or my dad Boss Man didn't understand what I said and actually meant that he was going to order them tomorrow. Meh."
                },
                {
                        "date": "5/23/2020 23:05:45",
                        "username": "tacowhisperer",
                        "title": "Start",
                        "link": "https://i.imgur.com/himZD0M.gifv",
                        "content": "In the beginning, there was a store called La Michoacana. It went broke, and was bought by The Men - Big Boss and Boss Man. And they reworked it into a 99¢ store. And on the 10th year, they expanded to the Food City a couple of streets down. And they reworked it into a supermarket. And from their intense managerial technique, they spawned the Militant Man, he who executes commands in parallel across the realm, and shuts the whole thing down early on Sundays because fuck that shit we gonna have a good Sunday night.\n\nThe Men, who art in business, hallowed be thy wholesale. Thy prices come, thy will be done, on margins as the meat comes packaged. Give us this day our daily hamburger bread, and forgive us our typos, as we go humbly ask for the void card in defeat. And lead us not into overtime, but deliver us from financial ruin. Amen.\n\nWelcome to the new Mexico Lindo blog! This is the place where I record the shenanigans happening at Mexico Lindo on in a small suburb of Texas. You won't be able to hear a goddamn thing walking into the store since the fans will grind your eardrums to a pulp, but here you will read about the best tales of all the crackheads that walk in, the fist fights that emerge between the grandmas, drunks, punks, and skanks, and the endless stream of Karens and shit-for-brains that walk through those beautiful, totally functional doors. \n\nTo kick things off, today officially marks the first day that both the morning cashiers and the afternoon cashiers know that there are only 2 more hand baskets left for the entire store. Maybe someone will finally realize that the basket holder that trips everyone over should be taken out before someone gets injured, but I actually predict that people will just keep asking for baskets until one day our only choice will be to tell them that this place doesn't have handheld baskets, and that they should have thought about how stupid they must feel for asking before daring to ask for a small and reasonable accomodation from our overlords.... errr.. managers (if you're reading this and you're a manager at Mexico Lindo, much love and praise and respec <3)."
                }
        ],
        "usernameContent": {
                "tacowhisperer": {
                        "display": "Andres S.",
                        "ppic": "https://pbs.twimg.com/profile_banners/389773262/1470411492/600x200",
                        "bio": "What do the tacos say?",
                        "link": "https://github.com/tacowhisperer",
                        "bday": "October 10, 1994"
                }
        }
}