{
        "blogContent": [
                {
                        "date": "6/21/2020 14:51:16",
                        "username": "tacowhisperer",
                        "title": "Sunday Sh*tshow with Boss Man and Friends",
                        "link": "https://giphy.com/gifs/Nx85vtTY70T3W`video/mp4",
                        "content": "Everything was indeed _not_ fine, and everything that could go wrong with the meat department did: worker shortages, hospitalizations from big cuts, supply mismanagement, order loss, you name it. Normally it really isn't front end people's jobs to worry about shenanigans in the back, but the void left by the dude that cut himself meant that I got (pro? de?)moted to delivery boy for the store's King-class customers. So today my day got split into delivery, loadout, cashiering, packaging, maintenance, and modeling (because apparently according to multiple elderly women I'm a papacito 😚).\n\nSo besides doing real work today other than typing numbers into a keyboard and the meat department on the brink of collapse today, nothing much else noteworthy happened. Eevee's gone, so I got assigned the morning shift for all week starting tomorrow for 5:30am, so at least I won't have to deal with the god awful pm-to-am work days for this week.\n\n✌"
                },
                {
                        "date": "6/20/2020 17:21:19",
                        "username": "tacowhisperer",
                        "title": "Call me the Saturday Speedway",
                        "link": "https://gfycat.com/drearytintedairedale`video/mp4",
                        "content": "I am speed, and execute tasks with their overdue poise. Today had me especially hectic as wholesales piled up left and right and so many regular purchases in between. Militant Man is the real superstar of the day, because without him, the carts pile up one after the other and the store starts looking like Sam's Club on March 2020 right as the coronavirus panic hit.\n\nOther than me showboating my skills at a ★★★☆☆ job, I didn't really have much time nor leftover attention to get good content for the blog today (I didn't even have time to get a quick snack or something before leaving lol). The only real event worth mentioning here was that Grape Man's card got declined, so he was only able to purchase 1 beer instead of 2 and paid his remaining balance with cash. He owes the register 5¢ and was really apologetic the entire time, so he might show up later today to pay it back. Poor dude -- however it is that he obtains money, he really does care about inconveniences he causes to workers here in the store and tries to minimize those as much as he knows how.\n\nGods I'm tired; that's all I got for today. [Here's a fun video to watch instead.](https://www.youtube.com/watch?v=VR9YQO4cX3U)"
                },
                {
                        "date": "6/19/2020 22:34:04",
                        "username": "tacowhisperer",
                        "title": "Bastions of the Mentally Deranged and Deep State Opposition Assemble!",
                        "link": "https://twitter.com/shenanigansen/status/974432428021374977?s=20`image/jpeg",
                        "content": "We had Grape Man, Quarter Ear Man, Sweaty Tit Money Lady, Slime Man, AND Mexican Dreamer made a guest appearance this afternoon, and Diet Coke Lady probably came in the morning so let's just go ahead and throw her in here too because, hey, why not.\n\n* Grape Man took the first swing by keeping quiet and simply asking for his cigars. I was tempted to probe him for content for the blog, but it's hardly ever worth the trouble of getting him to move on and not freak out the normal customers (and some of my coworkers), so I just let him be his own free spirit.\n* Quarter Ear Man is alive and well! He keeps on quartering up his ears like always, and seems to have made the best of whatever his current life situation is. I'll never forget the day I saw him singing full blast with the gentlemen that sing folk music outside for change. I mean, he was really getting in there with the lyrics, and I saw nothing but joy as they played his youth classics.\n* Sweaty Tit Money Lady.... this woman is a classic CLASSIC customer that keeps on leaving the register to go pick up items that she forgot to get. She always ALWAYS walks off to the other side of the store and takes her sweet time getting forgotten item after forgotten item, and even when the line behind her has grown beyond Boss Man's tolerance, she STILL has the gall to WALK to get more stuff. When she's finally actually done, and after she has made you go get cigarettes for her thus further delaying the line, when she pays in cash, it's money that she kept in her saggy, sweaty tits. Big oof. Today, it was Kintsu's turn to deal with her (sorry champ, better luck next time).\n* Slime Man, a nickname that I borrowed from a gay friend from college, came in full makeup and flamboyantly fashinable clothes to get his usual limes and other alcohol preparation materials. Apparently, if I were bi he would totally be down to get friendly with me (high key super flattering cuz you know gay people don't have the population density to be shy about how they feel feelsbadman). Good for him for being brave enough to rock that wear at a super f*cking male chauvinist (machista) store. I wouldn't dare come 10 feet of the parking lot in my romper lol\n* Finally, we have Mexican Dreamer. He's not actually mentally deranged or a crackhead or anything like that. He's actually one of the few-and-far-between white regulars of the store that also know Boss Man and the other Men at the more personal level. I brought up a comment that he's basically more than half way at being converted to a Mexican, and his response to that was that he is basically a Mexican Dreamer 🤣 Catch him sneaking into Mexico and getting deported back to the U.S. lmao\n\nAnyway, I personally can't get over how weird it is to have a whole pig just being carried around the store. They look like naked children from afar, and their freaking eyelids are either gone or kept open or something, and it's like we have a glazed eyes situation all over again. I know that's where our tamale meat comes from, but something about pig is just super upsetting to me. Funnily enough, today a big man brought in like 3 or 4 pigs inside a shopping cart, and due to the intense weight of piggies, the wheel left a track of skid marks across the length of the store until the back warehouse, so that must have been fun for the Chiefs to mop up lmaoo\n\nOne of the Men f*cking ordered more hand sanitizer 🤦‍♂️🤦‍♂️🤦‍♂️ I guess that the loss on the first batch currently stil available wasn't big enough to stop these people from giving it another go. This isn't unlike Reddit's world famous /r/wallstreetbets where every losing trader and their mamma try to \"average down\" their costs to finally turn a profit from their stock later on. Hopefully they know what they're doing and not just letting the lack of oxygen from face masks get the better of them lol\n\nNo new handheld baskets yet either haha lmao ok whatever"
                },
                {
                        "date": "6/18/2020 17:48:36",
                        "username": "tacowhisperer",
                        "title": "I witnessed the most mechanical, jaded response to our sh*tty POS frontend to date.",
                        "link": "https://giphy.com/gifs/game-of-thrones-sigh-wPOARRtwuFG0`video/mp4",
                        "content": "The morning started with a solo-ride from 5:30 to 6am; it was relatively peaceful with uninteresting and standard opening procedures like counting the cash register, opening up the cigarette closet, unlocking the ice chest, making coffee, etc.. When I'm alone up front like that, I keep an extra eye out for any customer that wants to come in shopping 🤢🤮 before I'm done opening up, I don't keep them waiting too long since being caught away from the register first thing in the morning by the Man in charge would be très bad. It's literally impossible to sneak into the store without me being aware since there's no noise other than the coffee machine and the taqueras in the kitchen moving trays around and what-not. Yet, somehow, an old man managed to f*cking teleport to the cash register and was waiting god knows how long because he gave me a quick attention holler. Granted, customers tend to call to your attention if you're away from the register for 0.0001 seconds, so take my wait time comment with a healthy dose of salt. Also, he was dressed in shorts and sandals, and had a 110% pillowhead action going on so clearly he still had some time to do whatever it is that people that go buying at the store this freaking early do, but I just can't believe either how unaware I am, or just how sneaky people can be. Jesus christ, this man could have gone all OMAE WA MOU SHINDEIRU on me and I would be dead before the even sun shone.\n\nFast forward a few hours, and it's slow as hell for a morning shift. I'm talking about Sunday-afternoon-right-as-Monday's-responsibilities-start-to-hit-you-full-stop type slow. This girl Eevee is nowhere to be seen since she very obviously asked for the day off for who knows why, so I'm working with Female Me on the primary cash register and she's asking get-to-know-you questions. She's pretty cool and fun to work with, so that took the dullness out of the morning some.\n\nDiet Coke Lady and Grape Man both made special visits today as well. She got her usual minus the cigars and left, so nothing spectacular there. Grape Man got his usual too, and on top of that he brought along his trademarked tinfoil hat commentary. This time, instead of turning off my brain and just laughing at the barrage of words, I decided to pay attention and later write down his train of thought for history's sake. Here goes....\n\nSo, he starts talking about some random tea the person ahead of him bought and how tea in general is good for you. So far so normal. He brings up an old, nasty dog bite that he got a few months ago and starts talking about the antioxidants in the tea and how they are able to treat inflammations like the one he had on his arm. That's when shit hits the fan. He mentions how the tea that person got is extra good because you can water it down and it still doesn't lose its potency, so it's an economic choice for treating the inflammation. Inflammation is bad for you because it constricts the veins and arteries in the aflicted area, and so cholesterol and fat deposits get lodged in there, which can lead to an embolism, but also a collection of heavy metals. From his research that he always does, he also learns about quantum gravity, and the 5G network and Big Comm's mission to suppress how 5G signals interact with the heavy metals in vaccines that then get injected into people because doctors that prepare the vaccine viles don't properly shake the viles and so when they inject the vaccine, the heavy metals deposit on the bottom of the vile and so some people get more metals than others into their systems. This, in turn, affects their blood cells, and more specifically, their hemoglobin molecular polarity. And then he stopped because he finally finished his transaction and just cut off and left. I cannot make this up, and it's hilarious to listen to every single time. Also, this is from what I remember hours after it happened and from a few notes that I was able to squeeze onto a small sheet of paper. What I wrote above is wayyyyyy more coherent, and possibly a different order, than what came out of Grape Man's mouth. So next time I bring up the man, you can make a safe bet he hit one of the topics I recorded lmao.\n\nHowever, the realest and most hilariously relatable story of the day is from Militant Man himself. I've only been working here for a year, and I've already become numb to certain scenarios and problems that arise on a day-to-day or week-to-week basis, so I imagine that what I feel is nothing compared to what Militant Man and the other Men (except maybe Big Boss, he don't give a shit) feel. So, it's another EBT transaction, and like many other stories I've written about here, this one involves a techincal issue because our POS really should stand for piece of sh*t. The lady's magnetic stripe is out of order, and she assumes that this is a valid store with perfectly functioning payment equipment. What she doesn't know, like so many before her, is that no one that I know of at this store knows how to enter EBT manually and have it go through, but she claims that it's been done here before (just like the pickle juice lady from another blog entry), so I take her word for it and assume that it's Militant Man with his integrated knowledge of our POS that magically knows what to press to make it work. So I go search for him and I find him busy-as-ever and drop the EBT bomb on him. Even though his face is hidden behind three layers of face masks, it doesn't take much to know that he's got that not-this-shit-again face. It was at this point that I knew.... this was gonna suck for all parties involved.\n\nSo back to my register we go, and I proceed to take the first few steps with Militant Man watching behind. I entered all of the numbers on the card, including the ones that the Texas government, for whatever reason, decided to hide on the bottom left corner of the card. Then, our POS system asked for an expiration date, and I looked back at Militant Man to get some cue as to what to do. Instead, right as I made eye contact I just see him slowly fade into the background noise, his eyes glaze over, and I'm 99.99% sure he said \"I don't know\" 😂🤣🤣🤣 This man has seen all kinds of shit that there is to be seen, and I could tell that he wasn't thinking about what was happening in front of him and instead was probably thinking about how much longer he has to work to safely retire and never EVER come back through those doors again. I mean, I'm not sure if my words capture it well, but his face went blank. Zero. Zilch. For a solid 5-10 seconds, he stood there motionless. This Man's level of jadedness, apathy, stone-cold mechanical exasperation was unlike anything I've seen IRL in another human being. Maybe he just had so many other more important things to worry about and this was eating away precious time, but the void he made finally collapsed and he snapped back into reality by asking for the EBT card and trying the magnetic strip. In the end, the EBT transaction failed, and Militant Man let them be $4 short by taking whatever cash they had on hand and let them leave. Nineteen more years of this and I'll be right there with Militant Man; Jesus save us."
                },
                {
                        "date": "6/17/2020 15:28:10",
                        "username": "tacowhisperer",
                        "title": "Maybe one day they will realize what's really going on here.",
                        "link": "https://www.youtube.com/watch?v=kSp-ZjQ2Sbc`video/mp4`https://gfycat.com/jointmildhousefly-steve-carell",
                        "content": "Signs are found throughout the store in every direction that you look, which I find to be problematic when it comes to an aesthetically pleasing store experience upon walking in for the first time. \n\nElegant solutions to this problem are difficult to realize, not only because the information on those signs is necessary, it helps let customers know what is going on their own terms. Problem is...\n\nNo one reads the damn things, and it doesn't help that some of the signs have typos on them in both English and Spanish like they were written on a\n\nDvorak keyboard or something.\n\nNevertheless, the signs persist, and\n\nUbiquitous as they are, they still find a way to blend into the background along with the cacophonies and whirs of store operations. I often find myself asking:\n\nDoes anyone else but me notice these details? Am I alone in caring enough about the barrage of information to people that can barely read DO NOT REMOVE on a card reader? It feels like\n\nEons will continue to go by, and assuming an unwavering persistence of apathy and inattentiveness, the status quo will remain the same. If the Men were to invest a tiny bit more into their estate, they could instead do something like\n\nSbisa dining hall at Texas A&M University in College Station. They keep only the most important information readily present at often-accessed locations in POIGNANT and CLEAR language. Maybe one day when I'm long gone......."
                },
                {
                        "date": "6/16/2020 21:55:53",
                        "username": "tacowhisperer",
                        "title": "Beggars can't be choosers",
                        "link": "https://media2.giphy.com/media/FyKfqRxVbzciY/giphy.mp4?cid=ecf05e47d52dcf74400cfc818820984fae7fa3b2b2b64992&rid=giphy.mp4`video/mp4",
                        "content": "Right off the bat, before I even had enough time to shake off the \"just arrived to work\" feeling, the man that asked for credit yesterday was causing trouble today. Credit Man went up to Boss Man, went all macho pancho with him, and after the coordial ritual was complete, he came to my register and ordered me to let him sign the receipt and call it a day. Call it the ole fool-me-once, but I wasn't going to have any shenanigans with the Boss Man over Credit Man again, so I didn't listen to what Credit Man was claiming and went straight to the Boss Man and told him what was going down. Boss Man made it veeery clear that he had zero intention on giving him any additional credit, especially since he just discarded his signed receipt yesterday like it was nothing, and I made sure to pass on that message to Credit Man. Maybe it's because Boss Man play fights with men like him all the time, but for some reason, it wasn't sinking into this man's brain that zero credit means 0, as in squat shit, as in pay up or shut up, so he kept coming back to my register and claiming that Boss Man had okayed the signing. It was a back and forth between Credit Man and Boss Man, until right at the end the poor woman that was kept waiting because of the whole ordeal generously decided to pay for Credit Man's food and let him leave. Even in the face of pure generosity that I made extra sure that she was okay with (my biggest respect to this woman, seriously), Credit Man was still claiming that he was leaving on a sign off and lying about having paid what he owed. For this man's sake, I hope that it's rent and utilities that came up and he's struggling to make ends meet, but I'm almost fairly certain that it's destructive habits and a violently self-harming lifestyle that has him asking for credit two days in a row. Either way, the last thing that I want is for Credit Man to get the wrong idea about me denying his signing, especially since he knows where I live and I definitely do NOT want him showing up to my house on a friendly visit 👊👊👊\n\njChief's on comedy 🔥🔥🔥 two days in a row now. This dingus decided to clean the corn tamale holder since nothing much else was going on at the time, and in the process of moving the incubator or whatever that keeps the tamales hot, he ended up spilling all of that corn water all over himself and the floor right as customers were trying to get in line to pay 🤦‍♂️😂\n\nBig Boss officially took an L on his hand sanitizer investment, which I calculated to be on the order of a $300 loss assuming that he can sell all of the bottles currently in the store at that newfound price. I suspect we're going to be seeing these bottles in there for many, many months, possibly years, to come. Big oof.\n\nFinally, Boss Man didn't bring the new baskets like I predicted 🙄"
                },
                {
                        "date": "6/15/2020 22:30:25",
                        "username": "tacowhisperer",
                        "title": "F",
                        "link": "https://i.pinimg.com/originals/f3/c5/c8/f3c5c892df98e5c8b845277791677fc8.gif`video/mp4",
                        "content": "It doesn't get much more vanilla with customers than this afternoon. With the next major holiday a few weeks away and no major sporting events on the horizon anytime soon, activity was kept to a modest few wholesale transactions, and a bulk number of small-to-medium-sized grocery purchases. Grape Man swung by and bought some cigars, told who knows what to QtSteel, and dipped into the afternoon sunset while leaving a wake of b.o., nicotine, and alcohol. Standard stuff, but the idiot story of the day is brought to you by jChief. Maybe it's the daily exposure to bleach and ammonia, or maybe it's the tightness of this boy's cap around his knoggin', but whatever the real cause may be, this dude went full stoopid today and it struck me right in the giggle dick.\n\nFor some background jChief usually comes paired with Earnest Chief, and usually start their day by hauling Boss Man's loot from Sam's Club into the store, and this afternoon was no exception. Some time afterward, jChief got an order to fill for a man that was physically present in the store, and at some point during the order, the man wanted a bag of dried chilli peppers. Normally, this isn't an issue, but the problem with the bags is that they come perforated to allow for airflow and whatnot. For storage and travel, these bags are fine, but they're not fine for handling in your face and tossing around to shake out excess debris before handing it over to someone in a poorly ventilated area...... which jChief did. Him and the man apparently got the sneezes pretty bad, and even after a few minutes of essentially pepper spraying themselves, I would catch myself coughing because of the secondhand chilli debris that was coming off of their clothing. jChief said that he shook it harder because at first it smelled good 🤦‍♂️😂😂🤣 What a fucking idiot. But he's our idiot <3\n\nImagine for a second that you're wearing bright pink underwear, and then imagine for another second that you left your fly down while shopping at the store. Nobody asked me to catch some cameltoe today, but this poor lady just had everything out there and it was very hard to take her seriously while she was talking to me about our transaction. I debated whether or not to do anything about it, but in the end I figured that I would want someone to discretely tell me, so I let her know what was up. Or in this case, down.\n\nOne of the bigger mysteries of this business is how one goes from being a total stranger, to being creditable enough with Boss Man to have the balls to ask him for credit for purchases. Over my time period working here, I've gotten to know the regulars that ask the Man for credit, and almost all of the time they pay him back in full (mostly because he actually gives them a call like the collection agency that he is). This one dude though, I don't know how he manages to convince him to get credit since he very obviously lives a drunk lifestyle (I can actually confirm this bias because I know where the man lives and very often see him drinking beer out on his porch). I asked Boss Man if it was okay for him to sign his account for $36 including beer, and after he reluctantly said yes, the man proceeded to scribble some random garbage on the receipt and then toss out his copy because he has zero intention of paying it back. I've heard this man speak before, and it's very present that he holds a grudge against the Men for having wealth while he has to live such a garbage lifestyle. He feels dangerously entitled to claim back some of the wealth he feels is kept from him, when in reality it's himself that holds the biggest barrier to moving forward. I know this because I see his choices, and I see how hard others in his peer group work to put their families and best interests first with blood, sweat, tears, and general wholesomeness that is very hard to come by people that don't fully know or understand what it's like to grow up in a poor environment. Didn't mean to go on a morality rant like that, but it is sad to see this and sort of just shrug and write about coworkers snorting chilli pepper. ANYWAY.\n\nIt happened. It actually f*cking happened........\n\nWe only have 1 basket left. I got the biggest confirmation to date from Boss Man about the basket situation. He said \"hopefully\" he remembers to bring the new ones tomorrow (I sincerely doubt he'll remember until maybe 3 days from now, assuming he actually has the baskets on-hand at home or somewhere). \n\nThis has been the latest information regarding petty issues happening at a local grocery store in a small suburb of Texas. Please like, comment, and subscribe as soon as I get off my ass and actually implement that functionality into this blog lmao.\n\nRona is back on the rise, so we fukd.\n\nThat is all 😊"
                },
                {
                        "date": "6/14/2020 15:13:30",
                        "username": "tacowhisperer",
                        "title": "Sunday Funday with Boss Man and Friends",
                        "link": "https://66.media.tumblr.com/0822b81adbe25ab44eccfdd4ad628648/97099731b97276d3-6d/s400x600/4d8c7173802a32bbd759387f525af790de2effa4.gifv`video/mp4",
                        "content": "We went ahead and marked the second day that the main carnicero man is absent, so ordering meat this morning was pretty much done on a just-in-time basis -- means longer wait times if you wanted something that wasn't already on the display. This wasn't unlike our hamburger bread sales where we charge bags of bread and then go pack them once we're done charging, because that stuff was fresh OUT. Forty-six cases of 20 buns, boom, gone once again.\n\nThis old woman came in today and demanded exclusive attention from everyone from the time she came in to the time she got her loot loaded into her car. She was kind of an asshole to the meat people because she wanted them to give her wholesale prices that they just couldn't give to her. At this location, wholesale prices are kept mostly up in the front registers and exclusively controlled by the Man in charge, and this knucklehead woman wasn't having any of that. After she forced price information out of Boss Man and made her order, she had one carnicero take a box of cow lip back to the meat department and get it exchanged for a different one because she didn't like that the box was damaged 🤦‍♂️ Loading her stuff into her car wasn't a fun time either; she made me grab her shit and \"carefully place it somewhere else\" like, woman, I ain't your car cleanup crew. No tip either lmao I am become calloused and apathetic.\n\nDick Cream Man came in with some other crazy man, saw Boss Man, and they started to non-jokingly yell obscenities at each other. It ended with Boss Man yelling at both of them to fuck off, and then one of the dudes yelled back at Boss Man that \"he would die like the rest of them\" 😮😐😐 Really inspires me to open up my own grocery store and have men with down syndrome yell death threats to me from across the store."
                },
                {
                        "date": "6/13/2020 20:28:16",
                        "username": "tacowhisperer",
                        "title": "You get a pen, you get a pen, YOU get a pen, EVERYBODY GETS A PEN!!!!",
                        "link": "https://media.giphy.com/media/jUwpNzg9IcyrK/giphy.gif`video/mp4",
                        "content": "Pens, paper towels, and Windex -- the Father, Son, and Holy Spirit of items that disappear from the front and are never to be seen again. I opened a pack of pens about a week or two ago, and today I took the last pen from that packet. That pen's name, Houdini. I f*cking lost it a couple of hours later 🤦‍♂️\n\nBesides walking in 10 minutes late to work today due to I-physically-can't-wake-up-earlier reasons and then proceeding to get over the very dry hump from 7 to 10am by packing some red fajita seasoning, nothing super special or aggravating happened this morning with customers.\n\nDiet Coke lady walked in this morning to buy a pack of GrApE cIgArS and Diet Coke.... She's easily lost somewhere on the order of 80 pounds because she's starting to take on more and more of that typical frail crackhead look. I'm starting to believe that the days that she first started walking in daily to the store a few months ago were a time period when she either went jobless, homeless, or both, and now she actually lost access to a steady food supply. Feelsbadman.\n\nA top carnicero was out this morning, so poor Militant Man was out here balancing 3 job loads until the second top carnicero man walked in to supplement in the meat department. This is the second time while I've been working here that I witness Militant Man at less than 100% militant operation mode, so even he's really feeling the overarching energy zap that everyone seems to be experiencing lately. Take my commentary with a nice, conic tinfoil hat, but I'm starting to think that the lack of oxygen from wearing face masks so many hours a day is actually starting to cause some health problems in everyone, because I swear that I haven't felt this god awful since I was sleeping fewer than 5 hours in college a few years ago. Maybe Grape Man is onto something with 5G, quantum (not quantum theory, quantum mechanics, or even quantum computing -- just quantum), or heavy metals in vaccines 🤷‍♂️\n\nEevee's in the afternoon shift with my buddies Kintsu, QtSteel, and Channing Fern (with the added addition of Big Boss's daughter, henceforth referred to as Cher), so we'll see what shenanigans unfold in the hours that pass by.\n\nDum dum woman from yesterday didn't report herself this morning, so I'm keeping my job, for now......."
                },
                {
                        "date": "6/12/2020 22:14:20",
                        "username": "tacowhisperer",
                        "title": "We desperately need elementary education reform",
                        "link": "https://i.pinimg.com/originals/97/a3/b9/97a3b92384b62eb04566a457f6d76f6c.gif`image/gif",
                        "content": "I just want to start today's blog entry by formally apologizing to my coworker QtSteel for assuming that this bitch Kintsu would be present at work today and everything would roll along smoothly (<3 to both of you). I don't know if it was the hour lateness, or my developing aspartame addiction, or my age, but my energy levels were low low low low for the first 3 hours or work hooooooly moly. At one point, my head was hurting too, so big yikes.\n\nBut personal issues aside, it seems that today was a fairly standard day. Everything went along buttery smooth after a proper team of cashiers was assembled, and no one had any issues whatsoever in any transactions that happened until close. Except that that is a fucking lie, and people are dumb as ever.\n\nOOOOOOooooOOooooooo 😤😤😤\n\nOk, so let me start by clarifying that yes, I fucked up a transaction multiple times, and I also had super shitty fucking luck in the order that I fucked up and the manner that the transaction was handled. But basically, I committed an innocent typo (in our store, the code for cilantro is 221, and instead of hitting ENTER to charge a price unit of cilantros, I hit the BEER button instead. This registered on the account as a taxable, non-food item, and because the price unit of cilantros is 4 for $1.29, I ended up charging 4 packs of $2.21 in beer, marking a grand total of $8.84 plus tax for something that should have been a $1.29 produce charge. Ok, no worries I thought. I've done this mistake like 10 times up to that point today, and a hundred gazillion times a week since I started working here. But, fuckup \\#2, instead of removing the beer charge by voiding from the BEER modifier button, I voided $8.84 of MEAT. Fuck, well at least the net charge was brought to close enough to zero that it didn't really matter since this was a business purchase that was asking for discounted price. I reached the end of the transaction, and fuckup \\#3, I failed to realize that the lady was paying with Lone Star, which spoiler alert, doesn't pay for beer. Once the transaction had gone through, there was still $9.57 left to pay with cash. So, after inspecting the receipt for why there was still an amount left to charge, I found my fuckup \\#2 and mended it by basically properly going through and making sure that fuckups \\#1 and \\#2 were correctly undone. As an exercise to the reader, see if you can figure out how you should undo those errors without cancelling the entire transaction, then read what I did and see if we come up with the same result... ... ... ...\n\nSo first, I started by properly removing the $8.84 of BEER by doing VOID 884 BEER. This brings the net total of taxable non-food items to 0. There's still a void of $8.84 in MEAT left in the account that's now left unbalanced, so I fixed that by re-adding $8.84 to the grand total through GROCERY (not MEAT since at this point I was kind of flustered trying to explain to the lady what had gone wrong, but it doesn't really matter because they're both Lone Star eligible). In summary, 8.84 of BEER - 8.84 of BEER = 0, and -8.84 of MEAT + 8.84 of GROCERY = 0, and when something is 0, it doesn't change the amount of the total if you add it, subtract it, lick it, or suck it. I genuinely need for someone to verify that this isn't a hard thing to understand, but if it is, you're uneducated and need to [go back to 3rd grade alebra with pawns and a balance and shit](https://www.youtube.com/watch?v=HBf25kNs0tA).\n\nAnyway, now it should be obvious to anyone properly following what is happening that the transaction total is still the same total that it was prior to pressing all of those dumb fucken buttons, but if not, that's okay. It's fucking balanced. Anyway, this means that now there's still a charge left of $8.84 left to pay, but with GROCERY, which is now eligible for the woman to pay with Lone Star and finish and fucking leave. Except that as soon as I tried explaining to her what had happened, her brain got stuck on \"I dId'Nt BuY bEeR wHy Is ThAt BeInG cHaRgEd I gOt CiLaNtRo WhY dO i StIlL nEeD tO pAy\". Like, I get that it's not an everyday type of error that one encounters when one goes shopping, but what should have been an easy explanation to a medium difficulty problem turned into a giant fucking shitshow with Boss Man yelling through the mic that WE NEED TO MOVE THE LINE 😂😂😂\n\nREEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE\n\nAnd it doesn't end there.\n\nBoss Man comes out of his mancave to inspect the damage and 🔨🔨🔨🔨🔨🔨 ball bust into moving the line (understandable since the line at this point was stupid long), and after literally doing the same thing that I did (add $8.84 of GROCERY) without even consenting or trying to explain to the woman why she needs to pay the $8.84, her total rose to $17.68 because Boss Man completely ignored that I had already added the missing amount back 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️ So, he nuked the whole thing, and everybody agreed that the transaction would be charged from scratch again. The lady's daughter? had already taken the cart and the items to their car, so she had to go get everything again, load it into the cart, and bring it back into the store. At this point, I'm in disbelief at how big this thing has become, and I'm seriously super confused why it could be so hard to understand the scope of the issue at hand. Anyway, Big Boss's daughter came in to the rescue and helped me by recharging everything on her account, but without the voids and the groceries and the meats and the whatever, and once her total was pretty much the same as last time, she STILL GOT THE RECEIPTS AND COMPARED THEM. I just wanted to see that I wasn't going crazy, and while I was looking through to make sure that she had been charged $8 more just like I had re-added to her account and put all of her braincells to overdrive, both I and Big Boss's daugher noticed that she hadn't brought back the Bimbo breads that she had bought. This bitch got a discount for not knowing math, AND to add salt to the wound, she literally told Big Boss's daughter to not interrupt me and her while I was explaining to her that her Lone Star card wasn't overcharged. Big Boss's daugher got MAD lmaooo\n\nI swear if she comes in tomorrow to claim that her Lone Star card was charged twice I'm gonna fucking quit this job."
                },
                {
                        "date": "6/11/2020 19:34:48",
                        "username": "tacowhisperer",
                        "title": "Hamburger bread is king, and we its entourage",
                        "link": "https://tenor.com/view/hamburglar-mc-donalds-hamburgers-hamburger-80s-gif-12540295`image/gif",
                        "content": "When I first arrived at this job, all I saw were mountains and mountains of hamburger bread just waiting to be packed. I just couldn't believe that _that much freaking cheap hamburger bread_ moved through the store, especially since I would often pack some only to have the shelf be overstuffed and old, moldy hamburger bread would stay hidden in the back of the bottom shelf. Now, not only does 45 trays of bread seem like too little, this kind of hamburger bread delivery has to be done 3 times a week because it sells out in about a day and a half. This amounts to a total of about 120-135 trays of hamburger bread (that's 2400-2700 individual hamburger buns) a week! Forget the meat man, IS HAMBERDER BREAD TIME.\n\nI was relunctant to share, but I oficially have a sugar mamma. This woman, God bless her heart, gives me $7 to $10 almost every week just because I remind her of her son, and she refuses my refusals every time. I feel like a lab rat now, because every time I see her, I've been conditioned to go into money receival mode lol To date, she has given me somewhere on the order of $50, but what she doesn't know is that I plan on giving it all back in some way that I'm still working out. Hopefully I can make this happen before the schedule shifts and I no longer get to see her regularly 🤞🤞 You saw it here first, folks.\n\nIn other random news, yesterday I found someone's SD card, along with a hair salon business card and some woman named Flor's phone number inside a plastic baggie. I didn't write about it in yesterday's blog entry because I was mostly busy doing boring old chores and other miscellaneous tasks, but toward the end of the day, I plugged the card into my laptop and I found photo sessions of the biggest pair of tiddies I have ever had the privilege to place my eyes on.\n\nSike.\n\nIt had photos going on 8+ years of age from someone that goes to the Catholic church down the road from where I live, and I recognized someone from one of the photos, so I went detective mode trying to figure out how to get that woman's phone number, and I ran across someone else from the church that happened to have her phone number, so now that SD card is back on track to its owner 👍 Someone remind me to implement a PAT AUTHOR ON THE BACK button, because I need external recognition of my achievements to feel alive.\n\nQUANTUM <-- Guess who dropped that one today. He also ordered 5 today, and plans on traveling to the past once he masters quantum.\n\nSo, Big Boss is on a Big Mission to get a gas station up and running, and he has taken the initiative of feeding the construction workers food from the store, on the house, so that's nice of him. However, the man himself has gotten very noticeably tan, and today I pointed that out to him. He said \"me voy a poner tanga para que salga bien el tan\" 😂😂🤣🤣 Caught me off guard with that one LMAOOO God bless this man and his fuck-you-I-do-what-I-want personality.\n\nOn a morning shift like today, once 1pm rolls around, time seems to hit _sonic speed_ cuz the anticipation of getting out and the sudden surge of people trying to get their fix of lunch/dinner for later speeds things up from whatever they were earlier in the day. I checked out my last customer like I would any other, fast as fuck boy, and I was getting ready to put out my report to go turn in my register, but an older gentleman had left some stuff on my register, and it was only a couple of things, so I decided to check him out since it was whatever.\n\nWell, I was fucking WRONG. Not only did he take his sweet ass time pulling out his wallet, made every mistake possible when paying with Lone Star and debit, but he was very very drunk too 🤦‍♂️🤦‍♂️ When I say every mistake, I mean every single mistake that customers do on a regular basis.\n\n1. He was swiping the magnetic strip the wrong way on the Lone Star\n2. He pressed debit instead of EBT-Food once he got the swipe right\n3. He entered the wrong PIN once he got EBT-Food right\n4. He delayed taking out other forms of payment when I explained to him that EBT doesn't cover Taqueria\n5. He had to enter the chip on his debit card 3 times and swipe, only to have the wrong PIN on that one too\n\nThere was more things that he fucked up, but as you might imagine, at this point, the man has been in line for like 10 minutes to do a 1-2 minute transaction. So, I took his card and just did everything for him, and I finally got to leave and take a sweet, well earned nap."
                },
                {
                        "date": "6/10/2020 11:25:41",
                        "username": "tacowhisperer",
                        "title": "Flashback Wednesday!",
                        "link": "https://media.giphy.com/media/14f7i886ytj56/giphy.gif`video/mp4",
                        "content": "Forget today, I didn't go to the store anyway and no one else wants to write for the blog, so we're doing a flashback today! Today's flashback edition: near death instances.\n\nWhile a lot of professionally run businesses divert their profits back into their companies for quality of life improvement and expansion, this little puppy right here has the bare minimum of that. You don't have to look very far to see old, tattered equipment _still in use_ from 20 years ago. In fact, I believe that their parking lot hasn't been redone since The Men bought the damn thing, but the equipment in question is the cash registers. It's very obvious that they've taken a hard beating for at least the past decade, and quite possibly for longer since no one is either knowledgeable enough or caring enough to try and fix some of the bigger mechanical or digital issues with the registers. For example, all registers claim to have Apple Pay, but it's a coin toss whether or not the thing is working, and it's impossible to explain to someone that has no knowledge of how the system works that if the card reader doesn't have green dots, it's not working (if you know what I'm talking about, you know, and if you don't, my point is proven). Or worse, register 2's hood isn't fixed in place by screws or anything, only by a single corner that properly slides into a small crevice in the register frame. What this means is that it often violently falls on the floor, and more often than not, there are children or elderly people right where it can damage their feet or what have you. A more seemingly innocent issue with the registers is that they will periodically stop scanning/weighing items. For the longest time, I assumed that these problems were easily fixable by resetting the scanner. I had done it a dozen times up until this point, and when Kintsu's register presented the problem, I felt confident that I could fix it for him and get things running again. I confidently told him to step aside and let a professional handle it, and as I reached into the wiring of the register to unplug the scanner to reset it, I ended up touching a conduit pipe and...\n\nGUHHHHHHHHHHHHHHHHHHHHHHHHHHHH\n\nI felt a big electric shock across the span of my arms and chest, and after at least a quarter of a second, I finally reacted to let go of the damn thing. I was very literally in shock, and I could still feel the electric disturbance in my chest near my heart 😀 Up until that point in my life, I've had maybe 1 or 2 close calls with live wires, but this one came the fuck out of nowhere. Maybe it's my lack of electrical knowledge, but one would assume that something that has to be manhandled frequently like a register at a store wouldn't have fucking electrically charged covered wires, but not here, no sir. I took a couple of minutes to reflect on what had just happened because I needed to retrace why I had gotten shocked so bad, and then I finally realized it's most likely because someone taped wires together inside the pipe and there was contact where there shouldn't be, and because I was holding onto the metal hood with my left arm while I was poking around with my right and I set myself up for that nasty ground discharge path. I got the sweats afterward, as one naturally does with a near death experience, but at least in my case, if that had been it for me, at least I would have died satisfied, knowing that I've done what I can and what I've wanted to within my moral and financial constraints.\n\nA second, non personally near death experience but definitely a hazardous one, was the time that the AC unit in the ceiling fell in the middle of rush hour with people walking around because the people in charge of installing it didn't properly secure it before removing the supporting structure while trying to change it out. Now THAT was a shitshow, both because when it fell, it didn't fall all the way to the floor (it got held up by the tortilla shelf and a corner of the ceiling tile), and customers weren't securing their children from walking under or near it while it was very possibly hanging on by something that wasn't designed to hold 200+ pounds of equipment and could have definitely taken the final plunge to the floor. After a couple of hours of watching frantic workers try and carefully lower it to the ground and breathing possibly asbestos since the pink fluffy insulation in the ceiling hasn't been changed since the store was bought because why would it, the situation was finally put under control and thankfully no one was injured.\n\n[Also, this happened here not super long ago](https://www.facebook.com/KPRC2/videos/south-houston-police-are-searching-for-at-least-four-robbers-they-say-overpowere/973342189526937/).\n\nImagine the number of near death stories from all other workers that have ever had the privilege to work here might have, jeez."
                },
                {
                        "date": "6/9/2020 23:05:13",
                        "username": "tacowhisperer",
                        "title": "Today was worse than meh, it was blugh.",
                        "link": "https://media.giphy.com/media/RKS1pHGiUUZ2g/giphy.gif`video/mp4",
                        "content": "I swear, Grape Man and Big Boss's daughter make for some great content. Sometimes, like today, Grape Man will come in dressed extra nicely with a button down shirt and jeans, so Big Boss's daughter commented on his outfit by asking him if he \"got the job!?!?\" Classic Grape Man response - he says he hasn't worked a day since he was young. Instead he makes his money through research.. possibly that means the stock market, but more likely it means some sort of government aid.\n\nAlso, some homeless? crackhead? definitely old man came walking in with a frail, scared looking, skittish dog throughout the store. Neither Big Boss nor anyone really cared to do anything about it, and in fact, Big Boss claimed that his daughter is defintely the reason people bring animals into the store lol. But, according to QtSteel, the man threatened to leave the derpy lookin' lopsided-ear dog at the store 😂 Poor thing.\n\nI didn't get the main register today, so I saw fewer people, and I didn't get to work on my special price job either since some a-hat at work threw away my price sheet 🤦‍♂️\n\nI NEED MORE AUTHORS FOR THIS BLOG. CALLING OUT TO YOU, FAM, HELP A BROTHER PUT GOOD CONTENT OUT HERE 🙏🙏🙏\n\nOk, cya."
                },
                {
                        "date": "6/8/2020 23:28:46",
                        "username": "tacowhisperer",
                        "title": "I still can't believe they're not bots.",
                        "link": "https://media.giphy.com/media/3oKIPePCftAupNSTmg/giphy.gif`video/mp4",
                        "content": "The clock reads 1:55pm, and I know that it's time to leave the comfort of my home once again. I unplug my phone from the charger, turn off my PC, slap on a face mask, grab my water bottle, and hit the road for another round of involuntary social interactions. God, what a pain to get off the car and walk in through those doors.. I slap on my public figure personality, drag my feet across the parking lot, and rush to my timesheet to clock in once more. It's not even the coronavirus that has me exhausted; it's the stagnation of a bunch of shitty, albeit could be worse, circumstances and events outside of my control that got me stuck swimming in molasses to move forward with my life.\n\nThen in comes the world renown Grape Man. Holy shit, the man, the myth, the legend. This man is pure gold, and he doesn't even know it. I'm at my register contemplating my existence, and this guy comes to the register behind me, and he doesn't say hi. No. He doesn't even address the current social context, weather, nor his 99¢ cigarettes. The very first words that come out of his mouth today -- IN RUSSIA 🤣😂🤣 He obviously couldn't see because of the mask, but I was already cracking up because it's gonna be good.\n\n\"In Russia, the only place that requires face masks is McDonald's\"\n\nNever change, Grape Man, never change. Do shower though, today you were specially smelly.\n\nAfter having my mind cleared from that interaction, I was officially in the game -- I was warmed up and dispatching customers lightning mcfast. Sometimes, I go so fast that customers aren't ready to pay when I tell them the total. Like, they stare at me wondering why I'm telling them a number (their total). This one middle aged woman though was wayyyy in lala land though. I told her her total, and not only did she struggle to figure out that I was finished; when she realized that she had to pay, she took out a $20 bill and tried to stick it into the card reader 🤦‍♂️😂 Even she realized how dumb that was, because she started laughing and laughing and honestly, it was contagious like coronavirus c;\n\nUsually, most of the time that I walk into the restroom and find some rando in there, interactions are awkward, and most of the time they walk out without washing their hands... WHY WHY WHY EWW. Today though, this numnuck stoopid ass perv walked into the restroom while I was using a urinal, and stood right behind me a couple of feet right where I could see him and he could see me. I turned around and made eye contact with him and he just stood there dumbfounded........ I was so shocked that someone could be so fucking stupid and not realize how invasive they're being that I didn't tell him anything. In no scenario today did I imagine that I would have to tell a grown ass man that he shouldn't stand right behind me while I'm trying to pee, wow. When I finished, he told me to \"Go ahead\" and I was thiiiiiis close to asking him why he stood there watching me take a leak. Damn. Like, this is definitely tmi so look away now you've been warned..... ... ... ... ok, so like, I'm not pee shy, which is especially helpful with the cramped ass restroom at work, but I almost felt my feed cut off from being so weirded out by the guy just standing there behind me lmao. I've said it before and I'll say it again -- these people are bots, prove me wrong 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️ Missed an opportunity to urinate on a grown man today. Never thought I'd tick that box off while being 100% sober.\n\nThe afternoon after that fiasco was pretty standard though. Bimbo man came in and brought ants on one of his boxes and Boss Man went full 🔨🔨🔨🔨🔨🔨 ball buster mode on him and made me get Raid to spray on the bread to kill the ants lol And then a lady was buying hamburger supplies, and bought a pickle jar that I made the mistake of giving to a small child to carry (the child broke the jar, surprise surprise). After being showered by the pickle juice, I offered her the chance to go get another one while I cleaned up the mess, so she had her older daughter go get another jar. Then she wanted to pay with food stamps, but needed for me to type in the numbers manually since here magnetic stripe doesn't work. I don't have any issue with typing in numbers or anything like that, but I still don't know how to do that, and when I informed her of this, she told her little children that they were going to another store because \"they don't want to type in the numbers for me here\". This bitch, after all the work I went to replacing her broken pickle jar too, wowww. Maybe it's the tone of voice I said it in, but whatever.\n\nBoss Man ended the day by angrily telling some random man that had a stroke or something to go buy his dick cream and leave."
                },
                {
                        "date": "6/7/2020 15:37:49",
                        "username": "tacowhisperer",
                        "title": "I didn't touch the coffee machine this morning, wow",
                        "link": "https://imgur.com/gallery/Homaq/comment/791986463/1`image/jpeg",
                        "content": "WHAT a freaking day, man. Usually, 🔥 days like these only happen with Militant Man, but this system is chaotic and entirely dependent on Boss Man's mood for the morning. Today, the mood was \"Why are there more cashiers than carniceros right now.\" Same, Boss Man, same.\n\nSo, I spend the majority of the morning and some of the midday hopping up and down the store getting pedidos ready to go (according to Pokémon Go, I walked 5 miles today, go figure), but today I got Mr. Luisito's order. It didn't seem so bad, just the usual weird shit he always buys like this VERY SPECIFIC BRAND OF SMOOTH PLATES OHMYGOD IF IT'S NOT THIS BRAND I WANT NOTHING, and caldo veggies. Except, that in my mind's eye, I didn't think that when the pedido said \"3 cabbage\", they meant 3 boxes of cabbage, so I just got this baldy 3 heads of cabbage and called it done. I fucking wish I was up front for this, it sounds like it would have been hilarious to watch from afar, but apparently, he made such a big god damned shitshow that his order WASN'T COMPLETE WHO THE FUCK DID THIS ORDER AHHHHH that even the taqueria ladies in the kitchen in the back were telling me about it LMAO. Jesus fuck now that's the Luisito I know. Fuck this man, but at the same time it's funny how stirred up he gets over minor details and very easily fixable problems........... just like Boss Man.\n\nI also worked on a pedido for La Morenita; ezpz stuff and very straightforward to complete. Today, after the transaction was all said and done, it was time to load it up to their delivery man's truck, and it was just me and Chief.com to get that done. I would say that we both did about equal parts work getting it loaded in, but when their delivery guy came up to tip, he passed the money in front of Chief.com's face and said told me \"Here you go, thanks.\" UHHHHH lol I didn't want to be a dick and keep it all, so I gave Chief.com 30%, but shit man people really do be clear cut on how they perceive work gets done. Apparently, I have a very \"hard working demeanor\", but really I just think it's the light skin ¯\\_(ツ)_/¯.\n\nFinally, Cash King came in today with half his face swollen from being in a fist fight. Don't fuck with Cash King."
                },
                {
                        "date": "6/6/2020 15:40:46",
                        "username": "tacowhisperer",
                        "title": "Title for cutest couple has officially been claimed, prove me wrong.",
                        "link": "https://66.media.tumblr.com/e87199f0c2e07c839183ddc42c6c6844/tumblr_pvkjrrVWpz1r27q3xo5_500.gifv`video/mp4",
                        "content": "The store opened up for the third time this week at 5:30am. As I imagined, the alarm clock this morning was just pure pain, like waking up for an 8am for college, but literally way fucking worse because it's out of necessity. And yet, somehow, there are people that see the doors open before 6am and just decide to start their day grocery shopping 🤮 Literally not even 10 minutes into opening, a crackhead couple walked into the store. Usually, when crackheads walk in bright and early in the morning, it means that they've been out and about and are looking for a quick fix of cigarettes or beer or something before moving on. This time though, these people got themselves a cart and started shopping around. In my time working here, I've only seen a handful of people that go 30+ minutes walking about shopping comparing prices and generally just taking their sweet time getting their errand done. No one batted an eye at this couple until 30, 40, 50 minutes went by and they were still walking around the store looking through item after item. After all the red flags had been raised, Militant Man went full, well, militant mode, just letting everyone know to keep an eye out for any funny business conducted by these people. I watched from afar how they went shelf by shelf, item by item, but neither of them had large bags or deep pockets to keep anything in, so I was just completely baffled, but mostly entertained by the prospect that someone would come in and first thing in the morning sack the store, especially before 6am.\n\nAfter the first morning rush of people trying to get their daily fix of coffee, I decided to go sleuthing and see what the deal with them was. I swear, these two were literally just casually shopping and reading the descriptions of every single item that they came across like it was their first time going shopping for themselves. They had a really nice demeanor, and I felt bad for judging them so harshly for their very obvious substance abuse. For example, the man would say \"Hey babe, come look at this soap. It says to use in HIGH EFFICIENCY machines!\" It really was that innocent of a trip, and I felt like an asshole for the rest of the time they were there. They ended up leaving around 7:30am, so they were easily in there for at least an hour and a half -- that's gotta be a record somewhere for genuine shopping time (they definitely won't beat this one old lady that comes in and takes like 3 hours to buy like 2 bags of cookies and a couple of vegetables and milk... that old lady is QUEEN at taking her sweet ass time, like not even The Men are willingly present that long in their own store lmao).\n\nMy one year anniversary is coming up in 21 days, so woooo...."
                },
                {
                        "date": "6/5/2020 22:25:07",
                        "username": "tacowhisperer",
                        "title": "Some days you start out feeling like $1000, then Boss Man comes in and gives you a reality check.",
                        "link": "https://giphy.com/gifs/htiVRuP7N0XK/html5`video/mp4",
                        "content": "Today's fuck up of the day that didn't happen today: I accepted a $50 bill that didn't have both serial numbers. Ugh. Granted, I didn't know about the serial number thing; I had just assumed that that one random bit about legal bills I read about 10 years ago about how a bill over 50% available is legal tender, but Boss Man really made sure to just 🔨🔨🔨🔨🔨🔨🔨 bust my balls today about it. Really puts a strain on how much longer I'll be able to put up with such open and raw reprimanding, but as soon as I take a look at the bank account, I just get sent riiiight back to my current state of affairs of having to work at this blessed grocery store. It really helps that even Boss Man's niece doesn't escape his event horizon; we're 35 years too late in changing his ways. F\n\nPaletero man showed up today and I finally actually ate the pop he gave me. It was good, and I only felt bloated for 2 hours after eating it, so it was definitely a win :P\n\nCute story update! So, children are starting to be let into the store by their parents as 'rona becomes older and older news every passing week. Of course, as soon as that thing arrives at the store, everyone is most definitely mega screwed. You see masks down on people everywhere, especially the boss man, but depressing news aside, I find it cute how people start to make kid's sized masks! Like, look at their dumb little faces, so innocent and unjaded... This mom was walking in with 3 of her little girls, and the smallest one didn't have her mask on. For some reason, mamma didn't remember about her face covering until they were inside the store, so she takes out what I would assume is a face mask for herself that she had in her purse and put it on her before they got too far inside. But her face is very obviously too small, and as soon as mom put the thing on her face, it was like she took saran wrap and wrapped her entire face from forehead to chin 😂😂😭 Normally, I'd say fuck 'em kids, but the way the little girl stumbled then when mom finally realized what she had done and I just couldn't contain myself. I laughed and the mom laughed too. Mom quickly fixed the mask for her, but my tender heart, omgggg.\n\nT minus 4 hours until I have to get up and start getting ready for work lmao I'm fucking dead on the inside and outside. Ok, bye."
                },
                {
                        "date": "6/4/2020 14:26:55",
                        "username": "tacowhisperer",
                        "title": "I am become manganer, he who commands Militant Man through pathos, logos, and ethos.",
                        "link": "https://tenor.com/FUIg.gif`image/gif",
                        "content": "Today I gave Militant Man a task -- to take a couple of unwanted chickens back to the carnicería, and he said \"yes sir\". I'm gonna ride that high until next week.\n\nSo, both Grape Man and Diet Coke Lady stopped by today, but neither of them did anything interesting other than buy, well, Grape cigars and Diet Coke. Grape Man DID comment on a coworker's outfit, so that's something I guess, but nothing else from them.\n\nThis old man came in today and was getting whatever. The thing that caught my attention from him, though, was that this man was casually wearing some toenail clippers on his necklace like he needs to be ready at a moment's notice of a sudden pedicure. For some reason, I found this amusing, but I didn't really ask him any questions. He reminded me of another old man that used to swing by fairly regularly - Quarter Ear Man. He would walk around the store and do everything normally, except that he would have a quarter sticking out from either ear.....\n\nRight toward the end of the shift, I had to charge a cartfull of random stuff for these 3 super round ladies. I'm no health guru, but I've spent well over a year working on changing my body so I've learned a thing or two about food nutrition, and by working here for the past 11 months at the time of this writing, I've definitely noticed that the quantity and proportion of sugary and fatty foods that people buy are directly proportional to their apparent body mass index. In layman's terms, fat people buy hella junk food, and these 3 ladies were no exception to this observation -- Bimbo, sandwich supplies, sweet bread, candy, cooking oil, every cheese imaginable, etc..\n\nOnce I was done charging their loot, the main one hollers at the other two \"Hey, y'all forgot to get the drinks. What are y'all gonna drink that meat with, air?\" Sure enough, I look down and they actually forgot to get anything to drink! As soon as I thought at them, \"maybe a little bit of water would help y'all some,\" another one yelled back \"Air? Bitch it's called water.\" Fucking LOOOOOL I held back my urge to laugh, and I watched in amusement as they scrambled among themselves to figure out what to get to drink until finally the one that thought they were drinking air waddled over to the cold Cokes and heaved a couple of 12 packs \"for good measure\". They paid with Lone Star, a classic move with cartfulls of junkfood (God bless poverty and the sugar that keeps it afloat), and finally went on their merry way.\n\nThis morning Militant Man has officially confirmed that the store will be opening at 5:30am. It makes sense because it's very rushed to try and get coffee done before swarms of people start walking in but fuuUuuUUuuUUuuuUUUUUuuUuuuck"
                },
                {
                        "date": "6/3/2020 15:38:00",
                        "username": "tacowhisperer",
                        "title": "Me tryinna sneak some work in without getting called to the register",
                        "link": "https://media.giphy.com/media/3ohhwytHcusSCXXOUg/giphy.gif`video/mp4",
                        "content": "Why in the actual f did I go to this blessed store on my day off? Money. That's why. The end."
                },
                {
                        "date": "6/2/2020 21:50:15",
                        "username": "tacowhisperer",
                        "title": "I remembered why I laughed yesterday LMAOO",
                        "link": "https://giphy.com/gifs/beckyg-booty-becky-g-6261Bb3IPHfqpfFtxY`video/mp4",
                        "content": "Ok, so yesterday I was charging Cash King, this one dude that buys meat for his taqueria. He's a respectable man; he always comes with his best boots and belt, and always pulls out nice THICK wads of unordered cash to pay for his tripas, chuck roll, pastor, you name it, hence the nickname. Something about his personality or his physical features (definitely both) rub off on you as him being a hard working, but also very personable man. So this very well shaped lady walks by while he's paying me, and he knows that I know that he knows that we know that that was some fiiiiiiiine booty walking by. This man pauses his cash counting, closes his eyes, and does a little sign of the cross, and then keeps on counting cash like the fucking king that he is LOOOOOOOOL God damn, that's a level of ass admiration that I've never seen anywhere else before 👏👏👏 I just can't believe I forgot entirely about this when I wrote my blog entry yesterday. Better late than never!\n\nToday's main superstar was gone - Kintsu you piece of shit, I love you bro, and it hurts when you're gone ;c Of all days to miss work, you chose payday you dum dum it better have been a good fucking reason. It wouldn't have been such a big deal though, if it weren't that Big Boss's daughter was also absent lmao. When we needed y'all most, you vanished! The show went on though, so mad props to QtSteel for pulling that bread through and me for knowing how to make up prices for big list items like the big genius that I am.\n\nBut enough about me and my big, sexy brain (that totally doesn't make mistakes ever). Instead, let's talk about this fucking lil fatty bitch of a 10-12 year old girl that started crying because her mommy didn't buy her Cheetos Funyuns. Holy moly. I'm not a parent yet, so take my words with a pound of salt, but there's undeniably an age cutoff for when kids should stop making spectacles out in public. Lord, if that were my kid I would beat that shit out of her so fast she never knew what hit her. I'm kidding of course, but I definitely wouldn't let that kind of behavior grow out of hand. Some of the parents that come in and buy stuff for their kids really do be out there being money slaves to their every whims like try keeping that up in their teens and young adult lives see how that works out for you. My guess is those kids would end up working at a grocery store run by some middle eastern middle aged men that have an authoritarian grasp over every aspect of how the store operates, to the point where they would remind you about an item you undercharged for two days because It'S iMpOrTaNt FoR mAiNtAiNiNg ThE pRoFiT mArGin. Bruh, a single (key word here SINGLE, as in 1 time) 60¢ loss on an item ain't gonna ruin the store, buddy. Still kinda salty about that one 😤😤😤\n\nANYWAY, Big Boss almost hit this dude with his truck. What a Big Boss thing for him to do 🤦‍♂️. Poor guy was mad at him, and for good reason, but good luck fighting the man that controls the entire suburb. He got the police department eating out of the palm of his hand BOY. This guy went to school with QtSteel, so she knows his name and personal details, but what she doesn't know that I know about him is where he lives (saw him walking out of his house on a trip to find stolen carts for Boss Man), and that he asked for Eevee's whereabouts one time around Thanksgiving/Christmas.\n\n🌈the more you know🌈🌟"
                },
                {
                        "date": "6/1/2020 22:22:41",
                        "username": "tacowhisperer",
                        "title": "I can't remember why I laughed big time today, but here's a funny story",
                        "link": "https://gfycat.com/demandingathleticisabellineshrike`video/mp4",
                        "content": "I like to complain a lot with my coworkers about the shitty clients, and don't get me wrong, they suck the life right out of your gonads. That being said, no shitty clients also means no super interesting stories to tell, sadly. Funniest part of the day was when my coworker was walking out and making her final purchase. The paletero brought her a mangonada specially for her, and she had left it in the cooler all day to take. She was fixing to walk away, and she tells me \"Hopefully the paletero didn't put any love potion in it cuz it ain't gonna work on me\". For some reason, I found that hilarious and random as fuck, so I played along and asked her \"Why, he's a good working man and full of nothing but sweetness\" and she responded \"Well, it's for my son, so if anyone's gonna be falling for him it's gonna be him\". Anyway, that was hilarious. To think that she was at one point my least favorite coworker too. You live and you learn I guess!\n\nUmmmmmmmmmmmmmmm, no crackheads today, baskets still suck, these riots and lootings be getting crazy, 2020 really be out here one upping itself every day, stonks only go up, okay I'm done."
                },
                {
                        "date": "5/31/2020 14:32:15",
                        "username": "tacowhisperer",
                        "title": "May, May goes away. Comes again another day.",
                        "link": "https://gfycat.com/elatedwarmherculesbeetle`video/mp4",
                        "content": "The word that best describes today: standard. No Grape Man today, so kind of a bummer on that one. We did get a special visit from Diet Coke Lady though! Man, that woman has lost some WEIGHT, probably cuz all she does is smoke all day and drink Diet Coke in between. Still has that crazy stink eye like always, and her manner of walking and talking still make it feel like she's gonna fall over and break her skull, but she certainly stopped coming over like she used to on the daily for her \"ChEaP 3 dOlLaR cIgArEtTeS\".\n\nFeelsbadman for the manager today: he tries so hard to be healthy and follow what I can only imagine is his doctor/wife's diet plan, but his little maneuver today is just priceless. He came to my register to pay for a 7-UP and some Funyuns, a classic move when he's got the munchies on the triple. I don't judge. In fact, I feel bad for him because I know just how badly he wants to stop being overweight. But anyways, I had noticed a little disposible tray in the register behind me, and usually that area is reserved for the managers when they're snacking. I didn't think much of it, until I had nothing going on for a brief couple of minutes. I opened up the container and found a fork and a few cactus bits in there. This man gave up eating the cactuses and got himself those Funyuns lmaooo Fucking same. Well, that, or he tried to cancel out his sinful food with some healthy stuff. Either way, it sucks that healthy food just doesn't taste that great, but what can I say other than the struggle is real."
                },
                {
                        "date": "5/30/2020 18:58:45",
                        "username": "tacowhisperer",
                        "title": "The day was pure 🔥🔥🔥, up to the very end.",
                        "link": "https://gfycat.com/angrygoldenisabellinewheatear-this-is-fine-gifcask`video/mp4",
                        "content": "Today was a suuuper busy morning, and I mean for whatever reason, everybody wanted to buy the biiiig big bulks of meat. Good for the store, bad for the back (I definitely strained my disks today, yikes....). This morning came in this pretty little princess of a man and his hog of a wife. Nothing out of the ordinary, except for the fact that my man wasn't \"attended like he should be\" and without him and his tiny purchase we don't get to get paid -_-. All of this at 6:30 in the fucking am just because my coworker didn't go out of her way to find another pack of coffee cups just for him since the ones he was forcing out of the cup holder kept ripping (this ding dong didn't realize that you can also get the cups from behind where they don't get damaged). Personally, I would have gotten him and his mistress their cups for coffee since it's whatever, but the man literally stayed quiet when I asked him how I could help and instead chose to keep on ranting and ranting and ranting. Jesus fuck, these people are literally bots -- prove me wrong. I accidentally made my coworker laugh for dismissing him as a lost case before he was out of earshot, and he turned around and yelled \"Go ahead and laugh at me, you clowns\". looool Outside the daily 1 or 2 frisky clients that want to make a giant fucking scandal out of the tiniest issues, everything seemed to be going about as smoothly as it could.\n\nThen came in this omega asshole. This motherfucker, Luisito, is an old, bald, arrogant, demanding, narcissistic sleaze, and every time he's in the store, everybody's cortisol level rises. Normally, I don't mind him doing his thing, but today Mr. Luisito decided it would be a good idea to not only interrupt me while I was trying to handle 3 different tasks at the same, but to do so while coming from behind me and snatching the pen I was using right out of my hand. THIS BITCH OOHHHHMAHHGAWD I fucking lost it. Normally, I'm a gentle giant, but today I went corporate on his ass. I snatched that pen right out of his hand and I told him straight up that if he wants something he has to wait his god damned turn. I don't know if I overdid it (according to my coworker, she'd never seen me be that visibly angry before), or if apart from all those adjectives I used to describe him he's also a lil bitch (probably definitely, yes), but boyyyyy this man changed his tune so quick. He started yes manning me for the remainder of the time he was in the store, and behaved pretty nicely after that. Man, my blood still boils thinking about this man, ugh SUBJECT CHANGE!\n\nOk, so funny moment flashback. This didn't happen today, it actually happened a few weeks ago, but it's worth mentioning here. Imagine it's March 20, 2020; the coronavirus pandemic is just barely a week old, and grocery stores have been sacked down to the offbrands of the offbrands. This hardy fucking store pulled through (BIG big props to our managers for working through that, I genuinely hope they've recovered from those tumultuous couple of weeks), but recovery wasn't obvious at the time. Now, imagine for a second that you're a dummy idiot and believe that the world's toilet paper supply would never recover from the scare, so you bought the giant $45 rolls that Mexico Lindo had (and still has) available. I would imagine you'd be livid to find out that the good brands of toilet paper slowly came back into circulation 3 weeks later, and now you're stuck with at least a year's worth of shitty toilet paper lmaoo.\n\nWell, this one Karen thought it would be a great idea to come back with one of those rolls and demand a refund for one of those giant packs. BRUHHHHHHHHHHHHHHHHHH There was a limit at the time of 1 of the little packs inside the giant pack at the time, and the managers HAD to have made a personal exception for her to buy the giant roll. That was the easiest professional \"fuck off\"'s I've ever seen been dealt to someone, and despite her persistence, our manager didn't yield and she left with her giant pack in shame. I swear, I expect the worst from people, and I'm somehow still surprised at how low and shameless some people are willing to go to have their way. The vibe in the air after she left defeated was cathartic; call it a post-nut clarity if you will.\n\nFinally, the basket holder's back in the tripping spot again yaaaay... We still got 2 baskets in this ho so fuck 'em up fam."
                },
                {
                        "date": "5/29/2020 22:39:17",
                        "username": "tacowhisperer",
                        "title": "I've made software more complex than Boss Man's personality lol",
                        "link": "https://giphy.com/gifs/fB938PbR1ulsA/html5`video/mp4",
                        "content": "Imagine walking up to Boss Man to start the day and you see THAT^^. I kind of already suspected what was going on, but it didn't take much (actually, I just kinda stood there) and he immediately just straight up told me he's sick and tired of babysitting Chief.com. Feelsbadman for him and Chief.com, but at the same time, this kid really do be out here hiding for hours at a time like............ just stay home if you're gonna fuck around. You wanna fuck around and be paid, you gotta get white collar job boy, JUST sayin'. To Chief.com's credit, he DID make a valuable contribution today: he made me figure out how many minutes there are in October lmaoo. Like, it's an easy calculation, but not the kind of thing you'd expect from Chief.com and friends. Good shit Chief.com, you go Chief.com!\n\nGrape Man joined the party today! He got his dinner of two 6 packs of cheap beer, but he surprisingly didn't ask for 99¢ cigs. Instead, he walked up to my register and said he was sorry for what he said last time -- that he didn't mean the things he said about Big Boss's daughter. Honestly, I didn't know what the hell he was talking about for about 3 sentences, until he mentioned that he was just \"blowing smoke up her ass\". LMAOOO Well, that's a sentence I never expected to hear from Grape Man, not because it's original or out of context. He's just usually not that cool about social situations; usually he's balls deep about some deep state conspiracy theory he saw on the YouTubes. Grape Man, if you have somehow through your own wit stumbled on this post, you're a beautiful human being in your own way, take a shower more often (I don't have the cojones to tell you in person), and what you got going on is, quite literally, something worth studying in depth. They say keep Austin weird, and you singlehandedly keep Texas weird my guy ;)\n\nToday a group of 3 musketeers showed up to buy a 24 pack of beer -- the over 21 guy, the money guy, and the wingman. Nothing seemed to be going out of the ordinary, until it was time to pay. I asked for ID, and after over 21 guy showed his 1996 birthday or wuteva, money guy pulled out a gift debit card. He does the card payment procedure, hears the beep, and then stares visibly confused at the screen. He knows the transaction didn't go through, and I tell him the card only paid for $6. I shit you not, this motherfucker starts going all Zach Galifianakis math meme on me, and then he starts laughing. He tells his bros his bitch of a girlfriend owes him $24 cuz he knew that hoe had money in it before he got it today. BRUHHHHHHHH I've only ever seen that kind of shortage analysis from Boss Man, but this dum-knuck lookin ass out here figuring out why he's short and laughing about it with the bros had me all kinds of laughing like wow, what a bitch to take your money bro :P He ended up paying with cash, but when the little receipt came up with the big bold $6 he paid, he was like \"Yeah, lemme show her that\" and he fucking took the little paper too. I was fucking dead after that I swear.\n\nThe year is 20XX. Coronavirus has killed 99% of boomers, and Mexico Lindo still hasn't obtained handheld baskets. +1 to my bro Kintsu for moving the goD dammned basket holder to where it doesn't trip people <3.\n\nWhat a fucken day."
                },
                {
                        "date": "5/28/2020 15:28:30",
                        "username": "tacowhisperer",
                        "title": "Some days, you go in wearing your shirt backward, and that's ok.",
                        "link": "https://giphy.com/gifs/CQhvppGGlxgA0`video/mp4",
                        "content": "Aaaaand the basket holder is right back in its tripping area as scheduled, so fuck me for trying to prevent people from falling over c: We still got the same 2 lone baskets, so who knows how much longer until the last little one is taken.... low key I kinda want to see what will happen when they inevitably disappear.\n\nI wore my shirt backward for the first 5 hours of work today, so that was something hilarious to have pointed out to me (thank you, kind old lady). Morning shifts tend to have much fewer crackheads and crazy people, so today wasn't anything extremely out of the ordinary. Probably the worst bit was that I fucked up a classic Lone-Star/cash transaction. I left this poor lady without food stamps for the rest of her month because I forgot that our shitty POS software ignores cash payments that are registered first.\n\nOh, and I got to hear Boss Man call his favorite employee a dumbass. At least he didn't show up high as fuck to work lmaoo."
                },
                {
                        "date": "5/26/2020 22:30:21",
                        "username": "tacowhisperer",
                        "title": "Grape man strikes back!",
                        "link": "https://gfycat.com/evergreenremarkablefowl-tinfoil-jones-alex-hat`video/mp4",
                        "content": "I officially proved it - the grape man can be smelled before he is seen; my buckaroo Kintsu over here saw me first hand identify him by scent. Today he came in and bought his usual 1-2 of beer and 99¢ cigarettes, and kept his tinfoil hat commentary to a minimum, but the funniest bit today for him was his commentary on me and the Big Boss's daughter. She made the usual play where she pretends to be related to me, and he fell just like everybody else, but what he did different is that he started making an in-depth analysis about our different power levels of work. According to him, she is 15% more potent than me at the job. Good shit, Grape man, good shit...\n\nPersonally for me, the highlight of the day was making an Excel template for the smaller sheets of stickers that we have available for price tags. I got to chill by the computer and burn close to an hour working with that, so that was nice. I probably burned through 30 sheets of paper to get it just right, but it's for science so fuck 'em up fam. What I really wish is that I could dedicate my full time to working on item pricing, and creating a more streamlined way of handling the ever-changing prices on items all around the store. However, there's other priorities right now, like telling one of your bigger regular clients to fuck off (good job with that one, Big Boss). Granted, I did hear him telling his daughter that the client had lied and was definitely in the wrong, so assuming that's the case, it's refreshing to see that bickering doesn't always work for clients. It's defintely off-putting to get stuck in the middle of those discussions though, but what can I say other than it's what makes the ins and outs of the day that much more interesting.\n\nFinally, today officially marks another day without new handheld baskets. I tried to move the basket container once again to a spot where it won't trip people over. Hopefully with the new placement, the morning shift people will leave it be and it will inspire management to give these baskets a bit more priority..... pfffffft LOL.\n\nThat's all folks!"
                },
                {
                        "date": "5/25/2020 22:10:43",
                        "username": "tacowhisperer",
                        "title": "What even happened today?",
                        "link": "https://gfycat.com/sarcasticeducatedjohndory`video/mp4",
                        "content": "There seemed to be a couple of high surges in people today, especially around the 2-4pm hour block. Lots of fajita and marinaded selections, probably the extra bits left over from all them food stamps the government handed out this month (God bless America). Probably the funniest thing I heard all day was Boss Man calling out a woman on how she was a bitch to her man and that's why her ex-husband divorced her.\n\nNo grape man today :(\n\nAlso no new handheld baskets either ¯\\_(ツ)_/¯"
                },
                {
                        "date": "5/24/2020 23:20:42",
                        "username": "tacowhisperer",
                        "title": "Day 2 of the simulation",
                        "link": "https://media1.tenor.com/images/2d7f787c0eb9201b379365cbe175a8f7/tenor.gif`image/gif",
                        "content": "Well, standard business today, just the usual ins and outs of the everyday swaths of people looking to buy barbacoa on a Sunday morning. Possibly the most exciting thing that happened today is I dropped a box of chile serrano on the floor lulz.\n\nAlso, grape man is shit out of luck because according to Boss Man, the supplier for his 99¢ cigarettes didn't have his sacred grape flavor. Also, fun fact, I finally found the YouTube channel where Grape Man gets all of his tinfoil commentary from! Odd TV 2 on YouTube; link [here for the interested](https://www.youtube.com/channel/UCtpfIuNZKBQRQ8WERQVt6FQ/videos)\n\nMy feed is basically fucked for the next month after searching for that one.\n\nFinally, I got verbal confirmation that we're getting new handheld baskets tomorrow, finally. That, or my dad Boss Man didn't understand what I said and actually meant that he was going to order them tomorrow. Meh."
                },
                {
                        "date": "5/23/2020 23:05:45",
                        "username": "tacowhisperer",
                        "title": "Start",
                        "link": "https://i.imgur.com/himZD0M.gifv`image/gif",
                        "content": "In the beginning, there was a meat market called Fernandez Meat Market. It went broke, and was bought by The Men - Boss the Father, Big Boss, Medium Boss, and Boss Man. And they reworked it into a 99¢ store. And on the 10th year, they expanded to the Food City a couple of streets down. And they reworked it into a supermarket. And from their intense managerial technique, they spawned the Militant Man, he who executes commands in parallel across the realm, and shuts the whole thing down early on Sundays because fuck that shit we gonna have a good Sunday night.\n\nLet us pray.\n\nOur Boss Men, who art in business, hallowed be thy wholesale. Thy prices come, thy will be done, on margins as the meat comes packaged. Give us this day our daily hamburger bread, and forgive us our typos, as we go humbly ask for the void card in defeat. And lead us not into overtime, but deliver us from financial ruin. Amen.\n\nWelcome to the blog! You might have had to scroll for a while to get to this post, so congratulations on making it to the end (or I should say beginning). This is the place where I record the shenanigans happening at a family-owned supermarket in a small suburb of Texas. You won't be able to hear a thing walking into the store since the fans will grind your eardrums to a pulp, but here you will read about the best tales of all the crackheads that walk in, the fist fights that emerge between the grandmas, drunks, punks, and skanks, the stream of Karens and shit-for-brains that walk through those beautiful, totally functional doors, and even all the wholesome stuff too (hey, it's not all bad).\n\nYou may find some of the earlier posts to be a bit more ranty and foul mouthed than later posts since the initial purpose of the blog was to have a venting space. Eventually, the voice and tone for the contents here smooth out into something else, but it's all here in its least doxxing form for your entertainment, so please enjoy.\n\nTo kick things off, today officially marks the first day that both the morning cashiers and the afternoon cashiers know that there are only 2 more hand baskets left for the entire store. Maybe someone will finally realize that the basket holder that trips everyone over should be taken out before someone gets injured, but I actually predict that people will just keep asking for baskets until one day our only choice will be to tell them that this place doesn't have handheld baskets, and that they should have thought about how stupid they must feel for asking before daring to ask for a small and reasonable accomodation from our overlords.... errr.. managers (if you're reading this and you're a manager at Mexico Lindo, much love and praise and respec <3)."
                }
        ],
        "blogContentHtml": [
                {
                        "date": "6/21/2020 14:51:16",
                        "username": "tacowhisperer",
                        "title": "Sunday Sh*tshow with Boss Man and Friends",
                        "link": "https://giphy.com/gifs/Nx85vtTY70T3W`video/mp4",
                        "content": "<p>Everything was indeed <em>not</em> fine, and everything that could go wrong with the meat department did: worker shortages, hospitalizations from big cuts, supply mismanagement, order loss, you name it. Normally it really isn't front end people's jobs to worry about shenanigans in the back, but the void left by the dude that cut himself meant that I got (pro? de?)moted to delivery boy for the store's King-class customers. So today my day got split into delivery, loadout, cashiering, packaging, maintenance, and modeling (because apparently according to multiple elderly women I'm a papacito 😚).</p>\n<p>So besides doing real work today other than typing numbers into a keyboard and the meat department on the brink of collapse today, nothing much else noteworthy happened. Eevee's gone, so I got assigned the morning shift for all week starting tomorrow for 5:30am, so at least I won't have to deal with the god awful pm-to-am work days for this week.</p>\n<p>✌</p>"
                },
                {
                        "date": "6/20/2020 17:21:19",
                        "username": "tacowhisperer",
                        "title": "Call me the Saturday Speedway",
                        "link": "https://gfycat.com/drearytintedairedale`video/mp4",
                        "content": "<p>I am speed, and execute tasks with their overdue poise. Today had me especially hectic as wholesales piled up left and right and so many regular purchases in between. Militant Man is the real superstar of the day, because without him, the carts pile up one after the other and the store starts looking like Sam's Club on March 2020 right as the coronavirus panic hit.</p>\n<p>Other than me showboating my skills at a ★★★☆☆ job, I didn't really have much time nor leftover attention to get good content for the blog today (I didn't even have time to get a quick snack or something before leaving lol). The only real event worth mentioning here was that Grape Man's card got declined, so he was only able to purchase 1 beer instead of 2 and paid his remaining balance with cash. He owes the register 5¢ and was really apologetic the entire time, so he might show up later today to pay it back. Poor dude -- however it is that he obtains money, he really does care about inconveniences he causes to workers here in the store and tries to minimize those as much as he knows how.</p>\n<p>Gods I'm tired; that's all I got for today. <a href=\"https://www.youtube.com/watch?v=VR9YQO4cX3U\">Here's a fun video to watch instead.</a></p>"
                },
                {
                        "date": "6/19/2020 22:34:04",
                        "username": "tacowhisperer",
                        "title": "Bastions of the Mentally Deranged and Deep State Opposition Assemble!",
                        "link": "https://twitter.com/shenanigansen/status/974432428021374977?s=20`image/jpeg",
                        "content": "<p>We had Grape Man, Quarter Ear Man, Sweaty Tit Money Lady, Slime Man, AND Mexican Dreamer made a guest appearance this afternoon, and Diet Coke Lady probably came in the morning so let's just go ahead and throw her in here too because, hey, why not.</p>\n<ul>\n<li>Grape Man took the first swing by keeping quiet and simply asking for his cigars. I was tempted to probe him for content for the blog, but it's hardly ever worth the trouble of getting him to move on and not freak out the normal customers (and some of my coworkers), so I just let him be his own free spirit.</li>\n<li>Quarter Ear Man is alive and well! He keeps on quartering up his ears like always, and seems to have made the best of whatever his current life situation is. I'll never forget the day I saw him singing full blast with the gentlemen that sing folk music outside for change. I mean, he was really getting in there with the lyrics, and I saw nothing but joy as they played his youth classics.</li>\n<li>Sweaty Tit Money Lady…. this woman is a classic CLASSIC customer that keeps on leaving the register to go pick up items that she forgot to get. She always ALWAYS walks off to the other side of the store and takes her sweet time getting forgotten item after forgotten item, and even when the line behind her has grown beyond Boss Man's tolerance, she STILL has the gall to WALK to get more stuff. When she's finally actually done, and after she has made you go get cigarettes for her thus further delaying the line, when she pays in cash, it's money that she kept in her saggy, sweaty tits. Big oof. Today, it was Kintsu's turn to deal with her (sorry champ, better luck next time).</li>\n<li>Slime Man, a nickname that I borrowed from a gay friend from college, came in full makeup and flamboyantly fashinable clothes to get his usual limes and other alcohol preparation materials. Apparently, if I were bi he would totally be down to get friendly with me (high key super flattering cuz you know gay people don't have the population density to be shy about how they feel feelsbadman). Good for him for being brave enough to rock that wear at a super f*cking male chauvinist (machista) store. I wouldn't dare come 10 feet of the parking lot in my romper lol</li>\n<li>Finally, we have Mexican Dreamer. He's not actually mentally deranged or a crackhead or anything like that. He's actually one of the few-and-far-between white regulars of the store that also know Boss Man and the other Men at the more personal level. I brought up a comment that he's basically more than half way at being converted to a Mexican, and his response to that was that he is basically a Mexican Dreamer 🤣 Catch him sneaking into Mexico and getting deported back to the U.S. lmao</li>\n</ul>\n<p>Anyway, I personally can't get over how weird it is to have a whole pig just being carried around the store. They look like naked children from afar, and their freaking eyelids are either gone or kept open or something, and it's like we have a glazed eyes situation all over again. I know that's where our tamale meat comes from, but something about pig is just super upsetting to me. Funnily enough, today a big man brought in like 3 or 4 pigs inside a shopping cart, and due to the intense weight of piggies, the wheel left a track of skid marks across the length of the store until the back warehouse, so that must have been fun for the Chiefs to mop up lmaoo</p>\n<p>One of the Men f*cking ordered more hand sanitizer 🤦‍♂️🤦‍♂️🤦‍♂️ I guess that the loss on the first batch currently stil available wasn't big enough to stop these people from giving it another go. This isn't unlike Reddit's world famous /r/wallstreetbets where every losing trader and their mamma try to \"average down\" their costs to finally turn a profit from their stock later on. Hopefully they know what they're doing and not just letting the lack of oxygen from face masks get the better of them lol</p>\n<p>No new handheld baskets yet either haha lmao ok whatever</p>"
                },
                {
                        "date": "6/18/2020 17:48:36",
                        "username": "tacowhisperer",
                        "title": "I witnessed the most mechanical, jaded response to our sh*tty POS frontend to date.",
                        "link": "https://giphy.com/gifs/game-of-thrones-sigh-wPOARRtwuFG0`video/mp4",
                        "content": "<p>The morning started with a solo-ride from 5:30 to 6am; it was relatively peaceful with uninteresting and standard opening procedures like counting the cash register, opening up the cigarette closet, unlocking the ice chest, making coffee, etc.. When I'm alone up front like that, I keep an extra eye out for any customer that wants to come in shopping 🤢🤮 before I'm done opening up, I don't keep them waiting too long since being caught away from the register first thing in the morning by the Man in charge would be très bad. It's literally impossible to sneak into the store without me being aware since there's no noise other than the coffee machine and the taqueras in the kitchen moving trays around and what-not. Yet, somehow, an old man managed to f*cking teleport to the cash register and was waiting god knows how long because he gave me a quick attention holler. Granted, customers tend to call to your attention if you're away from the register for 0.0001 seconds, so take my wait time comment with a healthy dose of salt. Also, he was dressed in shorts and sandals, and had a 110% pillowhead action going on so clearly he still had some time to do whatever it is that people that go buying at the store this freaking early do, but I just can't believe either how unaware I am, or just how sneaky people can be. Jesus christ, this man could have gone all OMAE WA MOU SHINDEIRU on me and I would be dead before the even sun shone.</p>\n<p>Fast forward a few hours, and it's slow as hell for a morning shift. I'm talking about Sunday-afternoon-right-as-Monday's-responsibilities-start-to-hit-you-full-stop type slow. This girl Eevee is nowhere to be seen since she very obviously asked for the day off for who knows why, so I'm working with Female Me on the primary cash register and she's asking get-to-know-you questions. She's pretty cool and fun to work with, so that took the dullness out of the morning some.</p>\n<p>Diet Coke Lady and Grape Man both made special visits today as well. She got her usual minus the cigars and left, so nothing spectacular there. Grape Man got his usual too, and on top of that he brought along his trademarked tinfoil hat commentary. This time, instead of turning off my brain and just laughing at the barrage of words, I decided to pay attention and later write down his train of thought for history's sake. Here goes….</p>\n<p>So, he starts talking about some random tea the person ahead of him bought and how tea in general is good for you. So far so normal. He brings up an old, nasty dog bite that he got a few months ago and starts talking about the antioxidants in the tea and how they are able to treat inflammations like the one he had on his arm. That's when shit hits the fan. He mentions how the tea that person got is extra good because you can water it down and it still doesn't lose its potency, so it's an economic choice for treating the inflammation. Inflammation is bad for you because it constricts the veins and arteries in the aflicted area, and so cholesterol and fat deposits get lodged in there, which can lead to an embolism, but also a collection of heavy metals. From his research that he always does, he also learns about quantum gravity, and the 5G network and Big Comm's mission to suppress how 5G signals interact with the heavy metals in vaccines that then get injected into people because doctors that prepare the vaccine viles don't properly shake the viles and so when they inject the vaccine, the heavy metals deposit on the bottom of the vile and so some people get more metals than others into their systems. This, in turn, affects their blood cells, and more specifically, their hemoglobin molecular polarity. And then he stopped because he finally finished his transaction and just cut off and left. I cannot make this up, and it's hilarious to listen to every single time. Also, this is from what I remember hours after it happened and from a few notes that I was able to squeeze onto a small sheet of paper. What I wrote above is wayyyyyy more coherent, and possibly a different order, than what came out of Grape Man's mouth. So next time I bring up the man, you can make a safe bet he hit one of the topics I recorded lmao.</p>\n<p>However, the realest and most hilariously relatable story of the day is from Militant Man himself. I've only been working here for a year, and I've already become numb to certain scenarios and problems that arise on a day-to-day or week-to-week basis, so I imagine that what I feel is nothing compared to what Militant Man and the other Men (except maybe Big Boss, he don't give a shit) feel. So, it's another EBT transaction, and like many other stories I've written about here, this one involves a techincal issue because our POS really should stand for piece of sh*t. The lady's magnetic stripe is out of order, and she assumes that this is a valid store with perfectly functioning payment equipment. What she doesn't know, like so many before her, is that no one that I know of at this store knows how to enter EBT manually and have it go through, but she claims that it's been done here before (just like the pickle juice lady from another blog entry), so I take her word for it and assume that it's Militant Man with his integrated knowledge of our POS that magically knows what to press to make it work. So I go search for him and I find him busy-as-ever and drop the EBT bomb on him. Even though his face is hidden behind three layers of face masks, it doesn't take much to know that he's got that not-this-shit-again face. It was at this point that I knew…. this was gonna suck for all parties involved.</p>\n<p>So back to my register we go, and I proceed to take the first few steps with Militant Man watching behind. I entered all of the numbers on the card, including the ones that the Texas government, for whatever reason, decided to hide on the bottom left corner of the card. Then, our POS system asked for an expiration date, and I looked back at Militant Man to get some cue as to what to do. Instead, right as I made eye contact I just see him slowly fade into the background noise, his eyes glaze over, and I'm 99.99% sure he said \"I don't know\" 😂🤣🤣🤣 This man has seen all kinds of shit that there is to be seen, and I could tell that he wasn't thinking about what was happening in front of him and instead was probably thinking about how much longer he has to work to safely retire and never EVER come back through those doors again. I mean, I'm not sure if my words capture it well, but his face went blank. Zero. Zilch. For a solid 5-10 seconds, he stood there motionless. This Man's level of jadedness, apathy, stone-cold mechanical exasperation was unlike anything I've seen IRL in another human being. Maybe he just had so many other more important things to worry about and this was eating away precious time, but the void he made finally collapsed and he snapped back into reality by asking for the EBT card and trying the magnetic strip. In the end, the EBT transaction failed, and Militant Man let them be $4 short by taking whatever cash they had on hand and let them leave. Nineteen more years of this and I'll be right there with Militant Man; Jesus save us.</p>"
                },
                {
                        "date": "6/17/2020 15:28:10",
                        "username": "tacowhisperer",
                        "title": "Maybe one day they will realize what's really going on here.",
                        "link": "https://www.youtube.com/watch?v=kSp-ZjQ2Sbc`video/mp4`https://gfycat.com/jointmildhousefly-steve-carell",
                        "content": "<p>Signs are found throughout the store in every direction that you look, which I find to be problematic when it comes to an aesthetically pleasing store experience upon walking in for the first time. </p>\n<p>Elegant solutions to this problem are difficult to realize, not only because the information on those signs is necessary, it helps let customers know what is going on their own terms. Problem is…</p>\n<p>No one reads the damn things, and it doesn't help that some of the signs have typos on them in both English and Spanish like they were written on a</p>\n<p>Dvorak keyboard or something.</p>\n<p>Nevertheless, the signs persist, and</p>\n<p>Ubiquitous as they are, they still find a way to blend into the background along with the cacophonies and whirs of store operations. I often find myself asking:</p>\n<p>Does anyone else but me notice these details? Am I alone in caring enough about the barrage of information to people that can barely read DO NOT REMOVE on a card reader? It feels like</p>\n<p>Eons will continue to go by, and assuming an unwavering persistence of apathy and inattentiveness, the status quo will remain the same. If the Men were to invest a tiny bit more into their estate, they could instead do something like</p>\n<p>Sbisa dining hall at Texas A&amp;M University in College Station. They keep only the most important information readily present at often-accessed locations in POIGNANT and CLEAR language. Maybe one day when I'm long gone…….</p>"
                },
                {
                        "date": "6/16/2020 21:55:53",
                        "username": "tacowhisperer",
                        "title": "Beggars can't be choosers",
                        "link": "https://media2.giphy.com/media/FyKfqRxVbzciY/giphy.mp4?cid=ecf05e47d52dcf74400cfc818820984fae7fa3b2b2b64992&rid=giphy.mp4`video/mp4",
                        "content": "<p>Right off the bat, before I even had enough time to shake off the \"just arrived to work\" feeling, the man that asked for credit yesterday was causing trouble today. Credit Man went up to Boss Man, went all macho pancho with him, and after the coordial ritual was complete, he came to my register and ordered me to let him sign the receipt and call it a day. Call it the ole fool-me-once, but I wasn't going to have any shenanigans with the Boss Man over Credit Man again, so I didn't listen to what Credit Man was claiming and went straight to the Boss Man and told him what was going down. Boss Man made it veeery clear that he had zero intention on giving him any additional credit, especially since he just discarded his signed receipt yesterday like it was nothing, and I made sure to pass on that message to Credit Man. Maybe it's because Boss Man play fights with men like him all the time, but for some reason, it wasn't sinking into this man's brain that zero credit means 0, as in squat shit, as in pay up or shut up, so he kept coming back to my register and claiming that Boss Man had okayed the signing. It was a back and forth between Credit Man and Boss Man, until right at the end the poor woman that was kept waiting because of the whole ordeal generously decided to pay for Credit Man's food and let him leave. Even in the face of pure generosity that I made extra sure that she was okay with (my biggest respect to this woman, seriously), Credit Man was still claiming that he was leaving on a sign off and lying about having paid what he owed. For this man's sake, I hope that it's rent and utilities that came up and he's struggling to make ends meet, but I'm almost fairly certain that it's destructive habits and a violently self-harming lifestyle that has him asking for credit two days in a row. Either way, the last thing that I want is for Credit Man to get the wrong idea about me denying his signing, especially since he knows where I live and I definitely do NOT want him showing up to my house on a friendly visit 👊👊👊</p>\n<p>jChief's on comedy 🔥🔥🔥 two days in a row now. This dingus decided to clean the corn tamale holder since nothing much else was going on at the time, and in the process of moving the incubator or whatever that keeps the tamales hot, he ended up spilling all of that corn water all over himself and the floor right as customers were trying to get in line to pay 🤦‍♂️😂</p>\n<p>Big Boss officially took an L on his hand sanitizer investment, which I calculated to be on the order of a $300 loss assuming that he can sell all of the bottles currently in the store at that newfound price. I suspect we're going to be seeing these bottles in there for many, many months, possibly years, to come. Big oof.</p>\n<p>Finally, Boss Man didn't bring the new baskets like I predicted 🙄</p>"
                },
                {
                        "date": "6/15/2020 22:30:25",
                        "username": "tacowhisperer",
                        "title": "F",
                        "link": "https://i.pinimg.com/originals/f3/c5/c8/f3c5c892df98e5c8b845277791677fc8.gif`video/mp4",
                        "content": "<p>It doesn't get much more vanilla with customers than this afternoon. With the next major holiday a few weeks away and no major sporting events on the horizon anytime soon, activity was kept to a modest few wholesale transactions, and a bulk number of small-to-medium-sized grocery purchases. Grape Man swung by and bought some cigars, told who knows what to QtSteel, and dipped into the afternoon sunset while leaving a wake of b.o., nicotine, and alcohol. Standard stuff, but the idiot story of the day is brought to you by jChief. Maybe it's the daily exposure to bleach and ammonia, or maybe it's the tightness of this boy's cap around his knoggin', but whatever the real cause may be, this dude went full stoopid today and it struck me right in the giggle dick.</p>\n<p>For some background jChief usually comes paired with Earnest Chief, and usually start their day by hauling Boss Man's loot from Sam's Club into the store, and this afternoon was no exception. Some time afterward, jChief got an order to fill for a man that was physically present in the store, and at some point during the order, the man wanted a bag of dried chilli peppers. Normally, this isn't an issue, but the problem with the bags is that they come perforated to allow for airflow and whatnot. For storage and travel, these bags are fine, but they're not fine for handling in your face and tossing around to shake out excess debris before handing it over to someone in a poorly ventilated area…… which jChief did. Him and the man apparently got the sneezes pretty bad, and even after a few minutes of essentially pepper spraying themselves, I would catch myself coughing because of the secondhand chilli debris that was coming off of their clothing. jChief said that he shook it harder because at first it smelled good 🤦‍♂️😂😂🤣 What a fucking idiot. But he's our idiot &lt;3</p>\n<p>Imagine for a second that you're wearing bright pink underwear, and then imagine for another second that you left your fly down while shopping at the store. Nobody asked me to catch some cameltoe today, but this poor lady just had everything out there and it was very hard to take her seriously while she was talking to me about our transaction. I debated whether or not to do anything about it, but in the end I figured that I would want someone to discretely tell me, so I let her know what was up. Or in this case, down.</p>\n<p>One of the bigger mysteries of this business is how one goes from being a total stranger, to being creditable enough with Boss Man to have the balls to ask him for credit for purchases. Over my time period working here, I've gotten to know the regulars that ask the Man for credit, and almost all of the time they pay him back in full (mostly because he actually gives them a call like the collection agency that he is). This one dude though, I don't know how he manages to convince him to get credit since he very obviously lives a drunk lifestyle (I can actually confirm this bias because I know where the man lives and very often see him drinking beer out on his porch). I asked Boss Man if it was okay for him to sign his account for $36 including beer, and after he reluctantly said yes, the man proceeded to scribble some random garbage on the receipt and then toss out his copy because he has zero intention of paying it back. I've heard this man speak before, and it's very present that he holds a grudge against the Men for having wealth while he has to live such a garbage lifestyle. He feels dangerously entitled to claim back some of the wealth he feels is kept from him, when in reality it's himself that holds the biggest barrier to moving forward. I know this because I see his choices, and I see how hard others in his peer group work to put their families and best interests first with blood, sweat, tears, and general wholesomeness that is very hard to come by people that don't fully know or understand what it's like to grow up in a poor environment. Didn't mean to go on a morality rant like that, but it is sad to see this and sort of just shrug and write about coworkers snorting chilli pepper. ANYWAY.</p>\n<p>It happened. It actually f*cking happened……..</p>\n<p>We only have 1 basket left. I got the biggest confirmation to date from Boss Man about the basket situation. He said \"hopefully\" he remembers to bring the new ones tomorrow (I sincerely doubt he'll remember until maybe 3 days from now, assuming he actually has the baskets on-hand at home or somewhere). </p>\n<p>This has been the latest information regarding petty issues happening at a local grocery store in a small suburb of Texas. Please like, comment, and subscribe as soon as I get off my ass and actually implement that functionality into this blog lmao.</p>\n<p>Rona is back on the rise, so we fukd.</p>\n<p>That is all 😊</p>"
                },
                {
                        "date": "6/14/2020 15:13:30",
                        "username": "tacowhisperer",
                        "title": "Sunday Funday with Boss Man and Friends",
                        "link": "https://66.media.tumblr.com/0822b81adbe25ab44eccfdd4ad628648/97099731b97276d3-6d/s400x600/4d8c7173802a32bbd759387f525af790de2effa4.gifv`video/mp4",
                        "content": "<p>We went ahead and marked the second day that the main carnicero man is absent, so ordering meat this morning was pretty much done on a just-in-time basis -- means longer wait times if you wanted something that wasn't already on the display. This wasn't unlike our hamburger bread sales where we charge bags of bread and then go pack them once we're done charging, because that stuff was fresh OUT. Forty-six cases of 20 buns, boom, gone once again.</p>\n<p>This old woman came in today and demanded exclusive attention from everyone from the time she came in to the time she got her loot loaded into her car. She was kind of an asshole to the meat people because she wanted them to give her wholesale prices that they just couldn't give to her. At this location, wholesale prices are kept mostly up in the front registers and exclusively controlled by the Man in charge, and this knucklehead woman wasn't having any of that. After she forced price information out of Boss Man and made her order, she had one carnicero take a box of cow lip back to the meat department and get it exchanged for a different one because she didn't like that the box was damaged 🤦‍♂️ Loading her stuff into her car wasn't a fun time either; she made me grab her shit and \"carefully place it somewhere else\" like, woman, I ain't your car cleanup crew. No tip either lmao I am become calloused and apathetic.</p>\n<p>Dick Cream Man came in with some other crazy man, saw Boss Man, and they started to non-jokingly yell obscenities at each other. It ended with Boss Man yelling at both of them to fuck off, and then one of the dudes yelled back at Boss Man that \"he would die like the rest of them\" 😮😐😐 Really inspires me to open up my own grocery store and have men with down syndrome yell death threats to me from across the store.</p>"
                },
                {
                        "date": "6/13/2020 20:28:16",
                        "username": "tacowhisperer",
                        "title": "You get a pen, you get a pen, YOU get a pen, EVERYBODY GETS A PEN!!!!",
                        "link": "https://media.giphy.com/media/jUwpNzg9IcyrK/giphy.gif`video/mp4",
                        "content": "<p>Pens, paper towels, and Windex -- the Father, Son, and Holy Spirit of items that disappear from the front and are never to be seen again. I opened a pack of pens about a week or two ago, and today I took the last pen from that packet. That pen's name, Houdini. I f*cking lost it a couple of hours later 🤦‍♂️</p>\n<p>Besides walking in 10 minutes late to work today due to I-physically-can't-wake-up-earlier reasons and then proceeding to get over the very dry hump from 7 to 10am by packing some red fajita seasoning, nothing super special or aggravating happened this morning with customers.</p>\n<p>Diet Coke lady walked in this morning to buy a pack of GrApE cIgArS and Diet Coke…. She's easily lost somewhere on the order of 80 pounds because she's starting to take on more and more of that typical frail crackhead look. I'm starting to believe that the days that she first started walking in daily to the store a few months ago were a time period when she either went jobless, homeless, or both, and now she actually lost access to a steady food supply. Feelsbadman.</p>\n<p>A top carnicero was out this morning, so poor Militant Man was out here balancing 3 job loads until the second top carnicero man walked in to supplement in the meat department. This is the second time while I've been working here that I witness Militant Man at less than 100% militant operation mode, so even he's really feeling the overarching energy zap that everyone seems to be experiencing lately. Take my commentary with a nice, conic tinfoil hat, but I'm starting to think that the lack of oxygen from wearing face masks so many hours a day is actually starting to cause some health problems in everyone, because I swear that I haven't felt this god awful since I was sleeping fewer than 5 hours in college a few years ago. Maybe Grape Man is onto something with 5G, quantum (not quantum theory, quantum mechanics, or even quantum computing -- just quantum), or heavy metals in vaccines 🤷‍♂️</p>\n<p>Eevee's in the afternoon shift with my buddies Kintsu, QtSteel, and Channing Fern (with the added addition of Big Boss's daughter, henceforth referred to as Cher), so we'll see what shenanigans unfold in the hours that pass by.</p>\n<p>Dum dum woman from yesterday didn't report herself this morning, so I'm keeping my job, for now…….</p>"
                },
                {
                        "date": "6/12/2020 22:14:20",
                        "username": "tacowhisperer",
                        "title": "We desperately need elementary education reform",
                        "link": "https://i.pinimg.com/originals/97/a3/b9/97a3b92384b62eb04566a457f6d76f6c.gif`image/gif",
                        "content": "<p>I just want to start today's blog entry by formally apologizing to my coworker QtSteel for assuming that this bitch Kintsu would be present at work today and everything would roll along smoothly (&lt;3 to both of you). I don't know if it was the hour lateness, or my developing aspartame addiction, or my age, but my energy levels were low low low low for the first 3 hours or work hooooooly moly. At one point, my head was hurting too, so big yikes.</p>\n<p>But personal issues aside, it seems that today was a fairly standard day. Everything went along buttery smooth after a proper team of cashiers was assembled, and no one had any issues whatsoever in any transactions that happened until close. Except that that is a fucking lie, and people are dumb as ever.</p>\n<p>OOOOOOooooOOooooooo 😤😤😤</p>\n<p>Ok, so let me start by clarifying that yes, I fucked up a transaction multiple times, and I also had super shitty fucking luck in the order that I fucked up and the manner that the transaction was handled. But basically, I committed an innocent typo (in our store, the code for cilantro is 221, and instead of hitting ENTER to charge a price unit of cilantros, I hit the BEER button instead. This registered on the account as a taxable, non-food item, and because the price unit of cilantros is 4 for $1.29, I ended up charging 4 packs of $2.21 in beer, marking a grand total of $8.84 plus tax for something that should have been a $1.29 produce charge. Ok, no worries I thought. I've done this mistake like 10 times up to that point today, and a hundred gazillion times a week since I started working here. But, fuckup #2, instead of removing the beer charge by voiding from the BEER modifier button, I voided $8.84 of MEAT. Fuck, well at least the net charge was brought to close enough to zero that it didn't really matter since this was a business purchase that was asking for discounted price. I reached the end of the transaction, and fuckup #3, I failed to realize that the lady was paying with Lone Star, which spoiler alert, doesn't pay for beer. Once the transaction had gone through, there was still $9.57 left to pay with cash. So, after inspecting the receipt for why there was still an amount left to charge, I found my fuckup #2 and mended it by basically properly going through and making sure that fuckups #1 and #2 were correctly undone. As an exercise to the reader, see if you can figure out how you should undo those errors without cancelling the entire transaction, then read what I did and see if we come up with the same result… … … …</p>\n<p>So first, I started by properly removing the $8.84 of BEER by doing VOID 884 BEER. This brings the net total of taxable non-food items to 0. There's still a void of $8.84 in MEAT left in the account that's now left unbalanced, so I fixed that by re-adding $8.84 to the grand total through GROCERY (not MEAT since at this point I was kind of flustered trying to explain to the lady what had gone wrong, but it doesn't really matter because they're both Lone Star eligible). In summary, 8.84 of BEER - 8.84 of BEER = 0, and -8.84 of MEAT + 8.84 of GROCERY = 0, and when something is 0, it doesn't change the amount of the total if you add it, subtract it, lick it, or suck it. I genuinely need for someone to verify that this isn't a hard thing to understand, but if it is, you're uneducated and need to <a href=\"https://www.youtube.com/watch?v=HBf25kNs0tA\">go back to 3rd grade alebra with pawns and a balance and shit</a>.</p>\n<p>Anyway, now it should be obvious to anyone properly following what is happening that the transaction total is still the same total that it was prior to pressing all of those dumb fucken buttons, but if not, that's okay. It's fucking balanced. Anyway, this means that now there's still a charge left of $8.84 left to pay, but with GROCERY, which is now eligible for the woman to pay with Lone Star and finish and fucking leave. Except that as soon as I tried explaining to her what had happened, her brain got stuck on \"I dId'Nt BuY bEeR wHy Is ThAt BeInG cHaRgEd I gOt CiLaNtRo WhY dO i StIlL nEeD tO pAy\". Like, I get that it's not an everyday type of error that one encounters when one goes shopping, but what should have been an easy explanation to a medium difficulty problem turned into a giant fucking shitshow with Boss Man yelling through the mic that WE NEED TO MOVE THE LINE 😂😂😂</p>\n<p>REEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE</p>\n<p>And it doesn't end there.</p>\n<p>Boss Man comes out of his mancave to inspect the damage and 🔨🔨🔨🔨🔨🔨 ball bust into moving the line (understandable since the line at this point was stupid long), and after literally doing the same thing that I did (add $8.84 of GROCERY) without even consenting or trying to explain to the woman why she needs to pay the $8.84, her total rose to $17.68 because Boss Man completely ignored that I had already added the missing amount back 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️ So, he nuked the whole thing, and everybody agreed that the transaction would be charged from scratch again. The lady's daughter? had already taken the cart and the items to their car, so she had to go get everything again, load it into the cart, and bring it back into the store. At this point, I'm in disbelief at how big this thing has become, and I'm seriously super confused why it could be so hard to understand the scope of the issue at hand. Anyway, Big Boss's daughter came in to the rescue and helped me by recharging everything on her account, but without the voids and the groceries and the meats and the whatever, and once her total was pretty much the same as last time, she STILL GOT THE RECEIPTS AND COMPARED THEM. I just wanted to see that I wasn't going crazy, and while I was looking through to make sure that she had been charged $8 more just like I had re-added to her account and put all of her braincells to overdrive, both I and Big Boss's daugher noticed that she hadn't brought back the Bimbo breads that she had bought. This bitch got a discount for not knowing math, AND to add salt to the wound, she literally told Big Boss's daughter to not interrupt me and her while I was explaining to her that her Lone Star card wasn't overcharged. Big Boss's daugher got MAD lmaooo</p>\n<p>I swear if she comes in tomorrow to claim that her Lone Star card was charged twice I'm gonna fucking quit this job.</p>"
                },
                {
                        "date": "6/11/2020 19:34:48",
                        "username": "tacowhisperer",
                        "title": "Hamburger bread is king, and we its entourage",
                        "link": "https://tenor.com/view/hamburglar-mc-donalds-hamburgers-hamburger-80s-gif-12540295`image/gif",
                        "content": "<p>When I first arrived at this job, all I saw were mountains and mountains of hamburger bread just waiting to be packed. I just couldn't believe that <em>that much freaking cheap hamburger bread</em> moved through the store, especially since I would often pack some only to have the shelf be overstuffed and old, moldy hamburger bread would stay hidden in the back of the bottom shelf. Now, not only does 45 trays of bread seem like too little, this kind of hamburger bread delivery has to be done 3 times a week because it sells out in about a day and a half. This amounts to a total of about 120-135 trays of hamburger bread (that's 2400-2700 individual hamburger buns) a week! Forget the meat man, IS HAMBERDER BREAD TIME.</p>\n<p>I was relunctant to share, but I oficially have a sugar mamma. This woman, God bless her heart, gives me $7 to $10 almost every week just because I remind her of her son, and she refuses my refusals every time. I feel like a lab rat now, because every time I see her, I've been conditioned to go into money receival mode lol To date, she has given me somewhere on the order of $50, but what she doesn't know is that I plan on giving it all back in some way that I'm still working out. Hopefully I can make this happen before the schedule shifts and I no longer get to see her regularly 🤞🤞 You saw it here first, folks.</p>\n<p>In other random news, yesterday I found someone's SD card, along with a hair salon business card and some woman named Flor's phone number inside a plastic baggie. I didn't write about it in yesterday's blog entry because I was mostly busy doing boring old chores and other miscellaneous tasks, but toward the end of the day, I plugged the card into my laptop and I found photo sessions of the biggest pair of tiddies I have ever had the privilege to place my eyes on.</p>\n<p>Sike.</p>\n<p>It had photos going on 8+ years of age from someone that goes to the Catholic church down the road from where I live, and I recognized someone from one of the photos, so I went detective mode trying to figure out how to get that woman's phone number, and I ran across someone else from the church that happened to have her phone number, so now that SD card is back on track to its owner 👍 Someone remind me to implement a PAT AUTHOR ON THE BACK button, because I need external recognition of my achievements to feel alive.</p>\n<p>QUANTUM &lt;-- Guess who dropped that one today. He also ordered 5 today, and plans on traveling to the past once he masters quantum.</p>\n<p>So, Big Boss is on a Big Mission to get a gas station up and running, and he has taken the initiative of feeding the construction workers food from the store, on the house, so that's nice of him. However, the man himself has gotten very noticeably tan, and today I pointed that out to him. He said \"me voy a poner tanga para que salga bien el tan\" 😂😂🤣🤣 Caught me off guard with that one LMAOOO God bless this man and his fuck-you-I-do-what-I-want personality.</p>\n<p>On a morning shift like today, once 1pm rolls around, time seems to hit <em>sonic speed</em> cuz the anticipation of getting out and the sudden surge of people trying to get their fix of lunch/dinner for later speeds things up from whatever they were earlier in the day. I checked out my last customer like I would any other, fast as fuck boy, and I was getting ready to put out my report to go turn in my register, but an older gentleman had left some stuff on my register, and it was only a couple of things, so I decided to check him out since it was whatever.</p>\n<p>Well, I was fucking WRONG. Not only did he take his sweet ass time pulling out his wallet, made every mistake possible when paying with Lone Star and debit, but he was very very drunk too 🤦‍♂️🤦‍♂️ When I say every mistake, I mean every single mistake that customers do on a regular basis.</p>\n<ol>\n<li>He was swiping the magnetic strip the wrong way on the Lone Star</li>\n<li>He pressed debit instead of EBT-Food once he got the swipe right</li>\n<li>He entered the wrong PIN once he got EBT-Food right</li>\n<li>He delayed taking out other forms of payment when I explained to him that EBT doesn't cover Taqueria</li>\n<li>He had to enter the chip on his debit card 3 times and swipe, only to have the wrong PIN on that one too</li>\n</ol>\n<p>There was more things that he fucked up, but as you might imagine, at this point, the man has been in line for like 10 minutes to do a 1-2 minute transaction. So, I took his card and just did everything for him, and I finally got to leave and take a sweet, well earned nap.</p>"
                },
                {
                        "date": "6/10/2020 11:25:41",
                        "username": "tacowhisperer",
                        "title": "Flashback Wednesday!",
                        "link": "https://media.giphy.com/media/14f7i886ytj56/giphy.gif`video/mp4",
                        "content": "<p>Forget today, I didn't go to the store anyway and no one else wants to write for the blog, so we're doing a flashback today! Today's flashback edition: near death instances.</p>\n<p>While a lot of professionally run businesses divert their profits back into their companies for quality of life improvement and expansion, this little puppy right here has the bare minimum of that. You don't have to look very far to see old, tattered equipment <em>still in use</em> from 20 years ago. In fact, I believe that their parking lot hasn't been redone since The Men bought the damn thing, but the equipment in question is the cash registers. It's very obvious that they've taken a hard beating for at least the past decade, and quite possibly for longer since no one is either knowledgeable enough or caring enough to try and fix some of the bigger mechanical or digital issues with the registers. For example, all registers claim to have Apple Pay, but it's a coin toss whether or not the thing is working, and it's impossible to explain to someone that has no knowledge of how the system works that if the card reader doesn't have green dots, it's not working (if you know what I'm talking about, you know, and if you don't, my point is proven). Or worse, register 2's hood isn't fixed in place by screws or anything, only by a single corner that properly slides into a small crevice in the register frame. What this means is that it often violently falls on the floor, and more often than not, there are children or elderly people right where it can damage their feet or what have you. A more seemingly innocent issue with the registers is that they will periodically stop scanning/weighing items. For the longest time, I assumed that these problems were easily fixable by resetting the scanner. I had done it a dozen times up until this point, and when Kintsu's register presented the problem, I felt confident that I could fix it for him and get things running again. I confidently told him to step aside and let a professional handle it, and as I reached into the wiring of the register to unplug the scanner to reset it, I ended up touching a conduit pipe and…</p>\n<p>GUHHHHHHHHHHHHHHHHHHHHHHHHHHHH</p>\n<p>I felt a big electric shock across the span of my arms and chest, and after at least a quarter of a second, I finally reacted to let go of the damn thing. I was very literally in shock, and I could still feel the electric disturbance in my chest near my heart 😀 Up until that point in my life, I've had maybe 1 or 2 close calls with live wires, but this one came the fuck out of nowhere. Maybe it's my lack of electrical knowledge, but one would assume that something that has to be manhandled frequently like a register at a store wouldn't have fucking electrically charged covered wires, but not here, no sir. I took a couple of minutes to reflect on what had just happened because I needed to retrace why I had gotten shocked so bad, and then I finally realized it's most likely because someone taped wires together inside the pipe and there was contact where there shouldn't be, and because I was holding onto the metal hood with my left arm while I was poking around with my right and I set myself up for that nasty ground discharge path. I got the sweats afterward, as one naturally does with a near death experience, but at least in my case, if that had been it for me, at least I would have died satisfied, knowing that I've done what I can and what I've wanted to within my moral and financial constraints.</p>\n<p>A second, non personally near death experience but definitely a hazardous one, was the time that the AC unit in the ceiling fell in the middle of rush hour with people walking around because the people in charge of installing it didn't properly secure it before removing the supporting structure while trying to change it out. Now THAT was a shitshow, both because when it fell, it didn't fall all the way to the floor (it got held up by the tortilla shelf and a corner of the ceiling tile), and customers weren't securing their children from walking under or near it while it was very possibly hanging on by something that wasn't designed to hold 200+ pounds of equipment and could have definitely taken the final plunge to the floor. After a couple of hours of watching frantic workers try and carefully lower it to the ground and breathing possibly asbestos since the pink fluffy insulation in the ceiling hasn't been changed since the store was bought because why would it, the situation was finally put under control and thankfully no one was injured.</p>\n<p><a href=\"https://www.facebook.com/KPRC2/videos/south-houston-police-are-searching-for-at-least-four-robbers-they-say-overpowere/973342189526937/\">Also, this happened here not super long ago</a>.</p>\n<p>Imagine the number of near death stories from all other workers that have ever had the privilege to work here might have, jeez.</p>"
                },
                {
                        "date": "6/9/2020 23:05:13",
                        "username": "tacowhisperer",
                        "title": "Today was worse than meh, it was blugh.",
                        "link": "https://media.giphy.com/media/RKS1pHGiUUZ2g/giphy.gif`video/mp4",
                        "content": "<p>I swear, Grape Man and Big Boss's daughter make for some great content. Sometimes, like today, Grape Man will come in dressed extra nicely with a button down shirt and jeans, so Big Boss's daughter commented on his outfit by asking him if he \"got the job!?!?\" Classic Grape Man response - he says he hasn't worked a day since he was young. Instead he makes his money through research.. possibly that means the stock market, but more likely it means some sort of government aid.</p>\n<p>Also, some homeless? crackhead? definitely old man came walking in with a frail, scared looking, skittish dog throughout the store. Neither Big Boss nor anyone really cared to do anything about it, and in fact, Big Boss claimed that his daughter is defintely the reason people bring animals into the store lol. But, according to QtSteel, the man threatened to leave the derpy lookin' lopsided-ear dog at the store 😂 Poor thing.</p>\n<p>I didn't get the main register today, so I saw fewer people, and I didn't get to work on my special price job either since some a-hat at work threw away my price sheet 🤦‍♂️</p>\n<p>I NEED MORE AUTHORS FOR THIS BLOG. CALLING OUT TO YOU, FAM, HELP A BROTHER PUT GOOD CONTENT OUT HERE 🙏🙏🙏</p>\n<p>Ok, cya.</p>"
                },
                {
                        "date": "6/8/2020 23:28:46",
                        "username": "tacowhisperer",
                        "title": "I still can't believe they're not bots.",
                        "link": "https://media.giphy.com/media/3oKIPePCftAupNSTmg/giphy.gif`video/mp4",
                        "content": "<p>The clock reads 1:55pm, and I know that it's time to leave the comfort of my home once again. I unplug my phone from the charger, turn off my PC, slap on a face mask, grab my water bottle, and hit the road for another round of involuntary social interactions. God, what a pain to get off the car and walk in through those doors.. I slap on my public figure personality, drag my feet across the parking lot, and rush to my timesheet to clock in once more. It's not even the coronavirus that has me exhausted; it's the stagnation of a bunch of shitty, albeit could be worse, circumstances and events outside of my control that got me stuck swimming in molasses to move forward with my life.</p>\n<p>Then in comes the world renown Grape Man. Holy shit, the man, the myth, the legend. This man is pure gold, and he doesn't even know it. I'm at my register contemplating my existence, and this guy comes to the register behind me, and he doesn't say hi. No. He doesn't even address the current social context, weather, nor his 99¢ cigarettes. The very first words that come out of his mouth today -- IN RUSSIA 🤣😂🤣 He obviously couldn't see because of the mask, but I was already cracking up because it's gonna be good.</p>\n<p>\"In Russia, the only place that requires face masks is McDonald's\"</p>\n<p>Never change, Grape Man, never change. Do shower though, today you were specially smelly.</p>\n<p>After having my mind cleared from that interaction, I was officially in the game -- I was warmed up and dispatching customers lightning mcfast. Sometimes, I go so fast that customers aren't ready to pay when I tell them the total. Like, they stare at me wondering why I'm telling them a number (their total). This one middle aged woman though was wayyyy in lala land though. I told her her total, and not only did she struggle to figure out that I was finished; when she realized that she had to pay, she took out a $20 bill and tried to stick it into the card reader 🤦‍♂️😂 Even she realized how dumb that was, because she started laughing and laughing and honestly, it was contagious like coronavirus c;</p>\n<p>Usually, most of the time that I walk into the restroom and find some rando in there, interactions are awkward, and most of the time they walk out without washing their hands… WHY WHY WHY EWW. Today though, this numnuck stoopid ass perv walked into the restroom while I was using a urinal, and stood right behind me a couple of feet right where I could see him and he could see me. I turned around and made eye contact with him and he just stood there dumbfounded…….. I was so shocked that someone could be so fucking stupid and not realize how invasive they're being that I didn't tell him anything. In no scenario today did I imagine that I would have to tell a grown ass man that he shouldn't stand right behind me while I'm trying to pee, wow. When I finished, he told me to \"Go ahead\" and I was thiiiiiis close to asking him why he stood there watching me take a leak. Damn. Like, this is definitely tmi so look away now you've been warned….. … … … ok, so like, I'm not pee shy, which is especially helpful with the cramped ass restroom at work, but I almost felt my feed cut off from being so weirded out by the guy just standing there behind me lmao. I've said it before and I'll say it again -- these people are bots, prove me wrong 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️ Missed an opportunity to urinate on a grown man today. Never thought I'd tick that box off while being 100% sober.</p>\n<p>The afternoon after that fiasco was pretty standard though. Bimbo man came in and brought ants on one of his boxes and Boss Man went full 🔨🔨🔨🔨🔨🔨 ball buster mode on him and made me get Raid to spray on the bread to kill the ants lol And then a lady was buying hamburger supplies, and bought a pickle jar that I made the mistake of giving to a small child to carry (the child broke the jar, surprise surprise). After being showered by the pickle juice, I offered her the chance to go get another one while I cleaned up the mess, so she had her older daughter go get another jar. Then she wanted to pay with food stamps, but needed for me to type in the numbers manually since here magnetic stripe doesn't work. I don't have any issue with typing in numbers or anything like that, but I still don't know how to do that, and when I informed her of this, she told her little children that they were going to another store because \"they don't want to type in the numbers for me here\". This bitch, after all the work I went to replacing her broken pickle jar too, wowww. Maybe it's the tone of voice I said it in, but whatever.</p>\n<p>Boss Man ended the day by angrily telling some random man that had a stroke or something to go buy his dick cream and leave.</p>"
                },
                {
                        "date": "6/7/2020 15:37:49",
                        "username": "tacowhisperer",
                        "title": "I didn't touch the coffee machine this morning, wow",
                        "link": "https://imgur.com/gallery/Homaq/comment/791986463/1`image/jpeg",
                        "content": "<p>WHAT a freaking day, man. Usually, 🔥 days like these only happen with Militant Man, but this system is chaotic and entirely dependent on Boss Man's mood for the morning. Today, the mood was \"Why are there more cashiers than carniceros right now.\" Same, Boss Man, same.</p>\n<p>So, I spend the majority of the morning and some of the midday hopping up and down the store getting pedidos ready to go (according to Pokémon Go, I walked 5 miles today, go figure), but today I got Mr. Luisito's order. It didn't seem so bad, just the usual weird shit he always buys like this VERY SPECIFIC BRAND OF SMOOTH PLATES OHMYGOD IF IT'S NOT THIS BRAND I WANT NOTHING, and caldo veggies. Except, that in my mind's eye, I didn't think that when the pedido said \"3 cabbage\", they meant 3 boxes of cabbage, so I just got this baldy 3 heads of cabbage and called it done. I fucking wish I was up front for this, it sounds like it would have been hilarious to watch from afar, but apparently, he made such a big god damned shitshow that his order WASN'T COMPLETE WHO THE FUCK DID THIS ORDER AHHHHH that even the taqueria ladies in the kitchen in the back were telling me about it LMAO. Jesus fuck now that's the Luisito I know. Fuck this man, but at the same time it's funny how stirred up he gets over minor details and very easily fixable problems……….. just like Boss Man.</p>\n<p>I also worked on a pedido for La Morenita; ezpz stuff and very straightforward to complete. Today, after the transaction was all said and done, it was time to load it up to their delivery man's truck, and it was just me and Chief.com to get that done. I would say that we both did about equal parts work getting it loaded in, but when their delivery guy came up to tip, he passed the money in front of Chief.com's face and said told me \"Here you go, thanks.\" UHHHHH lol I didn't want to be a dick and keep it all, so I gave Chief.com 30%, but shit man people really do be clear cut on how they perceive work gets done. Apparently, I have a very \"hard working demeanor\", but really I just think it's the light skin ¯_(ツ)_/¯.</p>\n<p>Finally, Cash King came in today with half his face swollen from being in a fist fight. Don't fuck with Cash King.</p>"
                },
                {
                        "date": "6/6/2020 15:40:46",
                        "username": "tacowhisperer",
                        "title": "Title for cutest couple has officially been claimed, prove me wrong.",
                        "link": "https://66.media.tumblr.com/e87199f0c2e07c839183ddc42c6c6844/tumblr_pvkjrrVWpz1r27q3xo5_500.gifv`video/mp4",
                        "content": "<p>The store opened up for the third time this week at 5:30am. As I imagined, the alarm clock this morning was just pure pain, like waking up for an 8am for college, but literally way fucking worse because it's out of necessity. And yet, somehow, there are people that see the doors open before 6am and just decide to start their day grocery shopping 🤮 Literally not even 10 minutes into opening, a crackhead couple walked into the store. Usually, when crackheads walk in bright and early in the morning, it means that they've been out and about and are looking for a quick fix of cigarettes or beer or something before moving on. This time though, these people got themselves a cart and started shopping around. In my time working here, I've only seen a handful of people that go 30+ minutes walking about shopping comparing prices and generally just taking their sweet time getting their errand done. No one batted an eye at this couple until 30, 40, 50 minutes went by and they were still walking around the store looking through item after item. After all the red flags had been raised, Militant Man went full, well, militant mode, just letting everyone know to keep an eye out for any funny business conducted by these people. I watched from afar how they went shelf by shelf, item by item, but neither of them had large bags or deep pockets to keep anything in, so I was just completely baffled, but mostly entertained by the prospect that someone would come in and first thing in the morning sack the store, especially before 6am.</p>\n<p>After the first morning rush of people trying to get their daily fix of coffee, I decided to go sleuthing and see what the deal with them was. I swear, these two were literally just casually shopping and reading the descriptions of every single item that they came across like it was their first time going shopping for themselves. They had a really nice demeanor, and I felt bad for judging them so harshly for their very obvious substance abuse. For example, the man would say \"Hey babe, come look at this soap. It says to use in HIGH EFFICIENCY machines!\" It really was that innocent of a trip, and I felt like an asshole for the rest of the time they were there. They ended up leaving around 7:30am, so they were easily in there for at least an hour and a half -- that's gotta be a record somewhere for genuine shopping time (they definitely won't beat this one old lady that comes in and takes like 3 hours to buy like 2 bags of cookies and a couple of vegetables and milk… that old lady is QUEEN at taking her sweet ass time, like not even The Men are willingly present that long in their own store lmao).</p>\n<p>My one year anniversary is coming up in 21 days, so woooo….</p>"
                },
                {
                        "date": "6/5/2020 22:25:07",
                        "username": "tacowhisperer",
                        "title": "Some days you start out feeling like $1000, then Boss Man comes in and gives you a reality check.",
                        "link": "https://giphy.com/gifs/htiVRuP7N0XK/html5`video/mp4",
                        "content": "<p>Today's fuck up of the day that didn't happen today: I accepted a $50 bill that didn't have both serial numbers. Ugh. Granted, I didn't know about the serial number thing; I had just assumed that that one random bit about legal bills I read about 10 years ago about how a bill over 50% available is legal tender, but Boss Man really made sure to just 🔨🔨🔨🔨🔨🔨🔨 bust my balls today about it. Really puts a strain on how much longer I'll be able to put up with such open and raw reprimanding, but as soon as I take a look at the bank account, I just get sent riiiight back to my current state of affairs of having to work at this blessed grocery store. It really helps that even Boss Man's niece doesn't escape his event horizon; we're 35 years too late in changing his ways. F</p>\n<p>Paletero man showed up today and I finally actually ate the pop he gave me. It was good, and I only felt bloated for 2 hours after eating it, so it was definitely a win :P</p>\n<p>Cute story update! So, children are starting to be let into the store by their parents as 'rona becomes older and older news every passing week. Of course, as soon as that thing arrives at the store, everyone is most definitely mega screwed. You see masks down on people everywhere, especially the boss man, but depressing news aside, I find it cute how people start to make kid's sized masks! Like, look at their dumb little faces, so innocent and unjaded… This mom was walking in with 3 of her little girls, and the smallest one didn't have her mask on. For some reason, mamma didn't remember about her face covering until they were inside the store, so she takes out what I would assume is a face mask for herself that she had in her purse and put it on her before they got too far inside. But her face is very obviously too small, and as soon as mom put the thing on her face, it was like she took saran wrap and wrapped her entire face from forehead to chin 😂😂😭 Normally, I'd say fuck 'em kids, but the way the little girl stumbled then when mom finally realized what she had done and I just couldn't contain myself. I laughed and the mom laughed too. Mom quickly fixed the mask for her, but my tender heart, omgggg.</p>\n<p>T minus 4 hours until I have to get up and start getting ready for work lmao I'm fucking dead on the inside and outside. Ok, bye.</p>"
                },
                {
                        "date": "6/4/2020 14:26:55",
                        "username": "tacowhisperer",
                        "title": "I am become manganer, he who commands Militant Man through pathos, logos, and ethos.",
                        "link": "https://tenor.com/FUIg.gif`image/gif",
                        "content": "<p>Today I gave Militant Man a task -- to take a couple of unwanted chickens back to the carnicería, and he said \"yes sir\". I'm gonna ride that high until next week.</p>\n<p>So, both Grape Man and Diet Coke Lady stopped by today, but neither of them did anything interesting other than buy, well, Grape cigars and Diet Coke. Grape Man DID comment on a coworker's outfit, so that's something I guess, but nothing else from them.</p>\n<p>This old man came in today and was getting whatever. The thing that caught my attention from him, though, was that this man was casually wearing some toenail clippers on his necklace like he needs to be ready at a moment's notice of a sudden pedicure. For some reason, I found this amusing, but I didn't really ask him any questions. He reminded me of another old man that used to swing by fairly regularly - Quarter Ear Man. He would walk around the store and do everything normally, except that he would have a quarter sticking out from either ear…..</p>\n<p>Right toward the end of the shift, I had to charge a cartfull of random stuff for these 3 super round ladies. I'm no health guru, but I've spent well over a year working on changing my body so I've learned a thing or two about food nutrition, and by working here for the past 11 months at the time of this writing, I've definitely noticed that the quantity and proportion of sugary and fatty foods that people buy are directly proportional to their apparent body mass index. In layman's terms, fat people buy hella junk food, and these 3 ladies were no exception to this observation -- Bimbo, sandwich supplies, sweet bread, candy, cooking oil, every cheese imaginable, etc..</p>\n<p>Once I was done charging their loot, the main one hollers at the other two \"Hey, y'all forgot to get the drinks. What are y'all gonna drink that meat with, air?\" Sure enough, I look down and they actually forgot to get anything to drink! As soon as I thought at them, \"maybe a little bit of water would help y'all some,\" another one yelled back \"Air? Bitch it's called water.\" Fucking LOOOOOL I held back my urge to laugh, and I watched in amusement as they scrambled among themselves to figure out what to get to drink until finally the one that thought they were drinking air waddled over to the cold Cokes and heaved a couple of 12 packs \"for good measure\". They paid with Lone Star, a classic move with cartfulls of junkfood (God bless poverty and the sugar that keeps it afloat), and finally went on their merry way.</p>\n<p>This morning Militant Man has officially confirmed that the store will be opening at 5:30am. It makes sense because it's very rushed to try and get coffee done before swarms of people start walking in but fuuUuuUUuuUUuuuUUUUUuuUuuuck</p>"
                },
                {
                        "date": "6/3/2020 15:38:00",
                        "username": "tacowhisperer",
                        "title": "Me tryinna sneak some work in without getting called to the register",
                        "link": "https://media.giphy.com/media/3ohhwytHcusSCXXOUg/giphy.gif`video/mp4",
                        "content": "<p>Why in the actual f did I go to this blessed store on my day off? Money. That's why. The end.</p>"
                },
                {
                        "date": "6/2/2020 21:50:15",
                        "username": "tacowhisperer",
                        "title": "I remembered why I laughed yesterday LMAOO",
                        "link": "https://giphy.com/gifs/beckyg-booty-becky-g-6261Bb3IPHfqpfFtxY`video/mp4",
                        "content": "<p>Ok, so yesterday I was charging Cash King, this one dude that buys meat for his taqueria. He's a respectable man; he always comes with his best boots and belt, and always pulls out nice THICK wads of unordered cash to pay for his tripas, chuck roll, pastor, you name it, hence the nickname. Something about his personality or his physical features (definitely both) rub off on you as him being a hard working, but also very personable man. So this very well shaped lady walks by while he's paying me, and he knows that I know that he knows that we know that that was some fiiiiiiiine booty walking by. This man pauses his cash counting, closes his eyes, and does a little sign of the cross, and then keeps on counting cash like the fucking king that he is LOOOOOOOOL God damn, that's a level of ass admiration that I've never seen anywhere else before 👏👏👏 I just can't believe I forgot entirely about this when I wrote my blog entry yesterday. Better late than never!</p>\n<p>Today's main superstar was gone - Kintsu you piece of shit, I love you bro, and it hurts when you're gone ;c Of all days to miss work, you chose payday you dum dum it better have been a good fucking reason. It wouldn't have been such a big deal though, if it weren't that Big Boss's daughter was also absent lmao. When we needed y'all most, you vanished! The show went on though, so mad props to QtSteel for pulling that bread through and me for knowing how to make up prices for big list items like the big genius that I am.</p>\n<p>But enough about me and my big, sexy brain (that totally doesn't make mistakes ever). Instead, let's talk about this fucking lil fatty bitch of a 10-12 year old girl that started crying because her mommy didn't buy her Cheetos Funyuns. Holy moly. I'm not a parent yet, so take my words with a pound of salt, but there's undeniably an age cutoff for when kids should stop making spectacles out in public. Lord, if that were my kid I would beat that shit out of her so fast she never knew what hit her. I'm kidding of course, but I definitely wouldn't let that kind of behavior grow out of hand. Some of the parents that come in and buy stuff for their kids really do be out there being money slaves to their every whims like try keeping that up in their teens and young adult lives see how that works out for you. My guess is those kids would end up working at a grocery store run by some middle eastern middle aged men that have an authoritarian grasp over every aspect of how the store operates, to the point where they would remind you about an item you undercharged for two days because It'S iMpOrTaNt FoR mAiNtAiNiNg ThE pRoFiT mArGin. Bruh, a single (key word here SINGLE, as in 1 time) 60¢ loss on an item ain't gonna ruin the store, buddy. Still kinda salty about that one 😤😤😤</p>\n<p>ANYWAY, Big Boss almost hit this dude with his truck. What a Big Boss thing for him to do 🤦‍♂️. Poor guy was mad at him, and for good reason, but good luck fighting the man that controls the entire suburb. He got the police department eating out of the palm of his hand BOY. This guy went to school with QtSteel, so she knows his name and personal details, but what she doesn't know that I know about him is where he lives (saw him walking out of his house on a trip to find stolen carts for Boss Man), and that he asked for Eevee's whereabouts one time around Thanksgiving/Christmas.</p>\n<p>🌈the more you know🌈🌟</p>"
                },
                {
                        "date": "6/1/2020 22:22:41",
                        "username": "tacowhisperer",
                        "title": "I can't remember why I laughed big time today, but here's a funny story",
                        "link": "https://gfycat.com/demandingathleticisabellineshrike`video/mp4",
                        "content": "<p>I like to complain a lot with my coworkers about the shitty clients, and don't get me wrong, they suck the life right out of your gonads. That being said, no shitty clients also means no super interesting stories to tell, sadly. Funniest part of the day was when my coworker was walking out and making her final purchase. The paletero brought her a mangonada specially for her, and she had left it in the cooler all day to take. She was fixing to walk away, and she tells me \"Hopefully the paletero didn't put any love potion in it cuz it ain't gonna work on me\". For some reason, I found that hilarious and random as fuck, so I played along and asked her \"Why, he's a good working man and full of nothing but sweetness\" and she responded \"Well, it's for my son, so if anyone's gonna be falling for him it's gonna be him\". Anyway, that was hilarious. To think that she was at one point my least favorite coworker too. You live and you learn I guess!</p>\n<p>Ummmmmmmmmmmmmmm, no crackheads today, baskets still suck, these riots and lootings be getting crazy, 2020 really be out here one upping itself every day, stonks only go up, okay I'm done.</p>"
                },
                {
                        "date": "5/31/2020 14:32:15",
                        "username": "tacowhisperer",
                        "title": "May, May goes away. Comes again another day.",
                        "link": "https://gfycat.com/elatedwarmherculesbeetle`video/mp4",
                        "content": "<p>The word that best describes today: standard. No Grape Man today, so kind of a bummer on that one. We did get a special visit from Diet Coke Lady though! Man, that woman has lost some WEIGHT, probably cuz all she does is smoke all day and drink Diet Coke in between. Still has that crazy stink eye like always, and her manner of walking and talking still make it feel like she's gonna fall over and break her skull, but she certainly stopped coming over like she used to on the daily for her \"ChEaP 3 dOlLaR cIgArEtTeS\".</p>\n<p>Feelsbadman for the manager today: he tries so hard to be healthy and follow what I can only imagine is his doctor/wife's diet plan, but his little maneuver today is just priceless. He came to my register to pay for a 7-UP and some Funyuns, a classic move when he's got the munchies on the triple. I don't judge. In fact, I feel bad for him because I know just how badly he wants to stop being overweight. But anyways, I had noticed a little disposible tray in the register behind me, and usually that area is reserved for the managers when they're snacking. I didn't think much of it, until I had nothing going on for a brief couple of minutes. I opened up the container and found a fork and a few cactus bits in there. This man gave up eating the cactuses and got himself those Funyuns lmaooo Fucking same. Well, that, or he tried to cancel out his sinful food with some healthy stuff. Either way, it sucks that healthy food just doesn't taste that great, but what can I say other than the struggle is real.</p>"
                },
                {
                        "date": "5/30/2020 18:58:45",
                        "username": "tacowhisperer",
                        "title": "The day was pure 🔥🔥🔥, up to the very end.",
                        "link": "https://gfycat.com/angrygoldenisabellinewheatear-this-is-fine-gifcask`video/mp4",
                        "content": "<p>Today was a suuuper busy morning, and I mean for whatever reason, everybody wanted to buy the biiiig big bulks of meat. Good for the store, bad for the back (I definitely strained my disks today, yikes….). This morning came in this pretty little princess of a man and his hog of a wife. Nothing out of the ordinary, except for the fact that my man wasn't \"attended like he should be\" and without him and his tiny purchase we don't get to get paid -_-. All of this at 6:30 in the fucking am just because my coworker didn't go out of her way to find another pack of coffee cups just for him since the ones he was forcing out of the cup holder kept ripping (this ding dong didn't realize that you can also get the cups from behind where they don't get damaged). Personally, I would have gotten him and his mistress their cups for coffee since it's whatever, but the man literally stayed quiet when I asked him how I could help and instead chose to keep on ranting and ranting and ranting. Jesus fuck, these people are literally bots -- prove me wrong. I accidentally made my coworker laugh for dismissing him as a lost case before he was out of earshot, and he turned around and yelled \"Go ahead and laugh at me, you clowns\". looool Outside the daily 1 or 2 frisky clients that want to make a giant fucking scandal out of the tiniest issues, everything seemed to be going about as smoothly as it could.</p>\n<p>Then came in this omega asshole. This motherfucker, Luisito, is an old, bald, arrogant, demanding, narcissistic sleaze, and every time he's in the store, everybody's cortisol level rises. Normally, I don't mind him doing his thing, but today Mr. Luisito decided it would be a good idea to not only interrupt me while I was trying to handle 3 different tasks at the same, but to do so while coming from behind me and snatching the pen I was using right out of my hand. THIS BITCH OOHHHHMAHHGAWD I fucking lost it. Normally, I'm a gentle giant, but today I went corporate on his ass. I snatched that pen right out of his hand and I told him straight up that if he wants something he has to wait his god damned turn. I don't know if I overdid it (according to my coworker, she'd never seen me be that visibly angry before), or if apart from all those adjectives I used to describe him he's also a lil bitch (probably definitely, yes), but boyyyyy this man changed his tune so quick. He started yes manning me for the remainder of the time he was in the store, and behaved pretty nicely after that. Man, my blood still boils thinking about this man, ugh SUBJECT CHANGE!</p>\n<p>Ok, so funny moment flashback. This didn't happen today, it actually happened a few weeks ago, but it's worth mentioning here. Imagine it's March 20, 2020; the coronavirus pandemic is just barely a week old, and grocery stores have been sacked down to the offbrands of the offbrands. This hardy fucking store pulled through (BIG big props to our managers for working through that, I genuinely hope they've recovered from those tumultuous couple of weeks), but recovery wasn't obvious at the time. Now, imagine for a second that you're a dummy idiot and believe that the world's toilet paper supply would never recover from the scare, so you bought the giant $45 rolls that Mexico Lindo had (and still has) available. I would imagine you'd be livid to find out that the good brands of toilet paper slowly came back into circulation 3 weeks later, and now you're stuck with at least a year's worth of shitty toilet paper lmaoo.</p>\n<p>Well, this one Karen thought it would be a great idea to come back with one of those rolls and demand a refund for one of those giant packs. BRUHHHHHHHHHHHHHHHHHH There was a limit at the time of 1 of the little packs inside the giant pack at the time, and the managers HAD to have made a personal exception for her to buy the giant roll. That was the easiest professional \"fuck off\"'s I've ever seen been dealt to someone, and despite her persistence, our manager didn't yield and she left with her giant pack in shame. I swear, I expect the worst from people, and I'm somehow still surprised at how low and shameless some people are willing to go to have their way. The vibe in the air after she left defeated was cathartic; call it a post-nut clarity if you will.</p>\n<p>Finally, the basket holder's back in the tripping spot again yaaaay… We still got 2 baskets in this ho so fuck 'em up fam.</p>"
                },
                {
                        "date": "5/29/2020 22:39:17",
                        "username": "tacowhisperer",
                        "title": "I've made software more complex than Boss Man's personality lol",
                        "link": "https://giphy.com/gifs/fB938PbR1ulsA/html5`video/mp4",
                        "content": "<p>Imagine walking up to Boss Man to start the day and you see THAT^^. I kind of already suspected what was going on, but it didn't take much (actually, I just kinda stood there) and he immediately just straight up told me he's sick and tired of babysitting Chief.com. Feelsbadman for him and Chief.com, but at the same time, this kid really do be out here hiding for hours at a time like………… just stay home if you're gonna fuck around. You wanna fuck around and be paid, you gotta get white collar job boy, JUST sayin'. To Chief.com's credit, he DID make a valuable contribution today: he made me figure out how many minutes there are in October lmaoo. Like, it's an easy calculation, but not the kind of thing you'd expect from Chief.com and friends. Good shit Chief.com, you go Chief.com!</p>\n<p>Grape Man joined the party today! He got his dinner of two 6 packs of cheap beer, but he surprisingly didn't ask for 99¢ cigs. Instead, he walked up to my register and said he was sorry for what he said last time -- that he didn't mean the things he said about Big Boss's daughter. Honestly, I didn't know what the hell he was talking about for about 3 sentences, until he mentioned that he was just \"blowing smoke up her ass\". LMAOOO Well, that's a sentence I never expected to hear from Grape Man, not because it's original or out of context. He's just usually not that cool about social situations; usually he's balls deep about some deep state conspiracy theory he saw on the YouTubes. Grape Man, if you have somehow through your own wit stumbled on this post, you're a beautiful human being in your own way, take a shower more often (I don't have the cojones to tell you in person), and what you got going on is, quite literally, something worth studying in depth. They say keep Austin weird, and you singlehandedly keep Texas weird my guy ;)</p>\n<p>Today a group of 3 musketeers showed up to buy a 24 pack of beer -- the over 21 guy, the money guy, and the wingman. Nothing seemed to be going out of the ordinary, until it was time to pay. I asked for ID, and after over 21 guy showed his 1996 birthday or wuteva, money guy pulled out a gift debit card. He does the card payment procedure, hears the beep, and then stares visibly confused at the screen. He knows the transaction didn't go through, and I tell him the card only paid for $6. I shit you not, this motherfucker starts going all Zach Galifianakis math meme on me, and then he starts laughing. He tells his bros his bitch of a girlfriend owes him $24 cuz he knew that hoe had money in it before he got it today. BRUHHHHHHHH I've only ever seen that kind of shortage analysis from Boss Man, but this dum-knuck lookin ass out here figuring out why he's short and laughing about it with the bros had me all kinds of laughing like wow, what a bitch to take your money bro :P He ended up paying with cash, but when the little receipt came up with the big bold $6 he paid, he was like \"Yeah, lemme show her that\" and he fucking took the little paper too. I was fucking dead after that I swear.</p>\n<p>The year is 20XX. Coronavirus has killed 99% of boomers, and Mexico Lindo still hasn't obtained handheld baskets. +1 to my bro Kintsu for moving the goD dammned basket holder to where it doesn't trip people &lt;3.</p>\n<p>What a fucken day.</p>"
                },
                {
                        "date": "5/28/2020 15:28:30",
                        "username": "tacowhisperer",
                        "title": "Some days, you go in wearing your shirt backward, and that's ok.",
                        "link": "https://giphy.com/gifs/CQhvppGGlxgA0`video/mp4",
                        "content": "<p>Aaaaand the basket holder is right back in its tripping area as scheduled, so fuck me for trying to prevent people from falling over c: We still got the same 2 lone baskets, so who knows how much longer until the last little one is taken…. low key I kinda want to see what will happen when they inevitably disappear.</p>\n<p>I wore my shirt backward for the first 5 hours of work today, so that was something hilarious to have pointed out to me (thank you, kind old lady). Morning shifts tend to have much fewer crackheads and crazy people, so today wasn't anything extremely out of the ordinary. Probably the worst bit was that I fucked up a classic Lone-Star/cash transaction. I left this poor lady without food stamps for the rest of her month because I forgot that our shitty POS software ignores cash payments that are registered first.</p>\n<p>Oh, and I got to hear Boss Man call his favorite employee a dumbass. At least he didn't show up high as fuck to work lmaoo.</p>"
                },
                {
                        "date": "5/26/2020 22:30:21",
                        "username": "tacowhisperer",
                        "title": "Grape man strikes back!",
                        "link": "https://gfycat.com/evergreenremarkablefowl-tinfoil-jones-alex-hat`video/mp4",
                        "content": "<p>I officially proved it - the grape man can be smelled before he is seen; my buckaroo Kintsu over here saw me first hand identify him by scent. Today he came in and bought his usual 1-2 of beer and 99¢ cigarettes, and kept his tinfoil hat commentary to a minimum, but the funniest bit today for him was his commentary on me and the Big Boss's daughter. She made the usual play where she pretends to be related to me, and he fell just like everybody else, but what he did different is that he started making an in-depth analysis about our different power levels of work. According to him, she is 15% more potent than me at the job. Good shit, Grape man, good shit…</p>\n<p>Personally for me, the highlight of the day was making an Excel template for the smaller sheets of stickers that we have available for price tags. I got to chill by the computer and burn close to an hour working with that, so that was nice. I probably burned through 30 sheets of paper to get it just right, but it's for science so fuck 'em up fam. What I really wish is that I could dedicate my full time to working on item pricing, and creating a more streamlined way of handling the ever-changing prices on items all around the store. However, there's other priorities right now, like telling one of your bigger regular clients to fuck off (good job with that one, Big Boss). Granted, I did hear him telling his daughter that the client had lied and was definitely in the wrong, so assuming that's the case, it's refreshing to see that bickering doesn't always work for clients. It's defintely off-putting to get stuck in the middle of those discussions though, but what can I say other than it's what makes the ins and outs of the day that much more interesting.</p>\n<p>Finally, today officially marks another day without new handheld baskets. I tried to move the basket container once again to a spot where it won't trip people over. Hopefully with the new placement, the morning shift people will leave it be and it will inspire management to give these baskets a bit more priority….. pfffffft LOL.</p>\n<p>That's all folks!</p>"
                },
                {
                        "date": "5/25/2020 22:10:43",
                        "username": "tacowhisperer",
                        "title": "What even happened today?",
                        "link": "https://gfycat.com/sarcasticeducatedjohndory`video/mp4",
                        "content": "<p>There seemed to be a couple of high surges in people today, especially around the 2-4pm hour block. Lots of fajita and marinaded selections, probably the extra bits left over from all them food stamps the government handed out this month (God bless America). Probably the funniest thing I heard all day was Boss Man calling out a woman on how she was a bitch to her man and that's why her ex-husband divorced her.</p>\n<p>No grape man today :(</p>\n<p>Also no new handheld baskets either ¯_(ツ)_/¯</p>"
                },
                {
                        "date": "5/24/2020 23:20:42",
                        "username": "tacowhisperer",
                        "title": "Day 2 of the simulation",
                        "link": "https://media1.tenor.com/images/2d7f787c0eb9201b379365cbe175a8f7/tenor.gif`image/gif",
                        "content": "<p>Well, standard business today, just the usual ins and outs of the everyday swaths of people looking to buy barbacoa on a Sunday morning. Possibly the most exciting thing that happened today is I dropped a box of chile serrano on the floor lulz.</p>\n<p>Also, grape man is shit out of luck because according to Boss Man, the supplier for his 99¢ cigarettes didn't have his sacred grape flavor. Also, fun fact, I finally found the YouTube channel where Grape Man gets all of his tinfoil commentary from! Odd TV 2 on YouTube; link <a href=\"https://www.youtube.com/channel/UCtpfIuNZKBQRQ8WERQVt6FQ/videos\">here for the interested</a></p>\n<p>My feed is basically fucked for the next month after searching for that one.</p>\n<p>Finally, I got verbal confirmation that we're getting new handheld baskets tomorrow, finally. That, or my dad Boss Man didn't understand what I said and actually meant that he was going to order them tomorrow. Meh.</p>"
                },
                {
                        "date": "5/23/2020 23:05:45",
                        "username": "tacowhisperer",
                        "title": "Start",
                        "link": "https://i.imgur.com/himZD0M.gifv`image/gif",
                        "content": "<p>In the beginning, there was a meat market called Fernandez Meat Market. It went broke, and was bought by The Men - Boss the Father, Big Boss, Medium Boss, and Boss Man. And they reworked it into a 99¢ store. And on the 10th year, they expanded to the Food City a couple of streets down. And they reworked it into a supermarket. And from their intense managerial technique, they spawned the Militant Man, he who executes commands in parallel across the realm, and shuts the whole thing down early on Sundays because fuck that shit we gonna have a good Sunday night.</p>\n<p>Let us pray.</p>\n<p>Our Boss Men, who art in business, hallowed be thy wholesale. Thy prices come, thy will be done, on margins as the meat comes packaged. Give us this day our daily hamburger bread, and forgive us our typos, as we go humbly ask for the void card in defeat. And lead us not into overtime, but deliver us from financial ruin. Amen.</p>\n<p>Welcome to the blog! You might have had to scroll for a while to get to this post, so congratulations on making it to the end (or I should say beginning). This is the place where I record the shenanigans happening at a family-owned supermarket in a small suburb of Texas. You won't be able to hear a thing walking into the store since the fans will grind your eardrums to a pulp, but here you will read about the best tales of all the crackheads that walk in, the fist fights that emerge between the grandmas, drunks, punks, and skanks, the stream of Karens and shit-for-brains that walk through those beautiful, totally functional doors, and even all the wholesome stuff too (hey, it's not all bad).</p>\n<p>You may find some of the earlier posts to be a bit more ranty and foul mouthed than later posts since the initial purpose of the blog was to have a venting space. Eventually, the voice and tone for the contents here smooth out into something else, but it's all here in its least doxxing form for your entertainment, so please enjoy.</p>\n<p>To kick things off, today officially marks the first day that both the morning cashiers and the afternoon cashiers know that there are only 2 more hand baskets left for the entire store. Maybe someone will finally realize that the basket holder that trips everyone over should be taken out before someone gets injured, but I actually predict that people will just keep asking for baskets until one day our only choice will be to tell them that this place doesn't have handheld baskets, and that they should have thought about how stupid they must feel for asking before daring to ask for a small and reasonable accomodation from our overlords…. errr.. managers (if you're reading this and you're a manager at Mexico Lindo, much love and praise and respec &lt;3).</p>"
                }
        ],
        "usernameContent": {
                "tacowhisperer": {
                        "display": "(╯°□°)╯︵ ┻━┻",
                        "ppic": "https://pbs.twimg.com/profile_banners/389773262/1470411492/600x200",
                        "bio": "Quarter of my life gone by and got nothing to show for it :)",
                        "link": "https://github.com/tacowhisperer",
                        "bday": "October 10, 1994"
                }
        }
}